{
  "backend/main.mo": "Main Motoko actor defining all core data types (TVProgram, VideoContent, TVSeries, LiveChannel, Brand, AdMedia, etc.) and exposing backend API methods for a streaming platform with access control, blob storage, Stripe integration, and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to their relevant frontend files, component dependencies, and test IDs for admin dashboard, user management, content tabs, and access control restoration tasks.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for every frontend source file, describing the purpose and key implementation details of each component, page, and hook in the React app.",
  "frontend/index.html": "HTML entry point for the FAITH X-Stream frontend, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Defines all TanStack Router routes for the application (home, live, movies, podcasts, admin, player pages, etc.) and wraps the router with ThemeProvider and AuthProvider.",
  "frontend/src/components/admin/AnalyticsDashboard.tsx": "An admin dashboard component that fetches and displays platform analytics including total views, premium users, ad impressions, revenue, and a trending content list.",
  "frontend/src/components/admin/BrandManagement.tsx": "An admin panel for creating, deleting, and managing brands, including uploading a logo and assigning films, series, clips, or live channels to a selected brand.",
  "frontend/src/components/admin/ChannelManagement.tsx": "Admin component for creating, editing, and deleting live TV channels, including logo upload and original channel flagging via a form and edit dialog.",
  "frontend/src/components/admin/ClipsManagement.tsx": "Admin component for listing, editing captions of, and deleting video clips, with indicators for auto-generated and original clips.",
  "frontend/src/components/admin/LiveScheduleManagement.tsx": "Admin component for managing live channel schedules, allowing selection of a channel and adding or removing scheduled content programs with time and duration inputs.",
  "frontend/src/components/admin/ManualAdsManagement.tsx": "Admin component for uploading ad media files and creating ad assignments with targeting scope, position, and display rules via tabbed forms.",
  "frontend/src/components/admin/MasterAdminManagement.tsx": "Admin component that lists all users and allows a master admin to promote or demote users between user, admin, and master admin roles.",
  "frontend/src/components/admin/MoviesManagement.tsx": "Admin component for managing movie/film content, providing forms to upload new movies (with video, trailer, and thumbnail files) and edit or delete existing ones via dialogs.",
  "frontend/src/components/admin/PodcastsManagement.tsx": "Admin component for managing podcast content, allowing upload of new podcasts with video and thumbnail files, and editing or deleting existing podcast entries.",
  "frontend/src/components/admin/SeriesManagement.tsx": "Admin component for managing TV series, including creating series with thumbnails/trailers and nested management of seasons and episodes via multiple dialogs.",
  "frontend/src/components/admin/StripeSetup.tsx": "Admin component for configuring Stripe payment integration, displaying current configuration status and a form to submit a secret key and allowed countries.",
  "frontend/src/components/admin/VideoManagement.tsx": "General admin component for managing non-clip video content of various content types, supporting upload with metadata fields and edit/delete operations via dialogs.",
  "frontend/src/components/BrandRail.tsx": "Horizontally scrollable content rail for a single brand, displaying its associated films, series, and clips as VideoCard or SeriesCard items with navigation to the brand detail page.",
  "frontend/src/components/ClipsShortsFeed.tsx": "A vertical scroll-snapping feed component that displays short video clips with thumbnail overlays, play buttons, and metadata, supporting autoplay via intersection observer.",
  "frontend/src/components/ContentRow.tsx": "A horizontally scrollable row component that renders a titled list of VideoCard or SeriesCard items with left/right navigation arrow buttons.",
  "frontend/src/components/ContextualModal.tsx": "A reusable dialog modal that displays contextual messages (info, coming-soon, under-construction, feature-preview) with an appropriate icon, title, description, and optional action button.",
  "frontend/src/components/Footer.tsx": "A site footer with navigation links grouped into Browse, Discover, and Account sections, along with branding and a dynamic copyright year.",
  "frontend/src/components/Header.tsx": "A sticky top navigation header with logo, desktop nav links, search input, user profile dropdown, and mobile menu, supporting authenticated and admin states.",
  "frontend/src/components/HeroSection.tsx": "A full-width hero banner that auto-rotates through featured content items, displaying a background video or image with play/info buttons and optional mute toggle.",
  "frontend/src/components/Layout.tsx": "The root layout wrapper that renders the Header, page content via Outlet, Footer, and conditionally shows a ProfileSetupModal for Internet Identity users without a profile.",
  "frontend/src/components/live/LiveGuideGrid.tsx": "Renders an EPG-style program guide grid with a fixed channel column and a horizontally scrollable time-slot grid, auto-scrolling to the current time on mount.",
  "frontend/src/components/LiveTVSyncPlayer.tsx": "File is empty with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog component that collects a new user's display name and email, assigns the 'user' role via the backend actor, and saves the profile, invalidating the React Query cache on success.",
  "frontend/src/components/SeriesCard.tsx": "A clickable card component that displays a TV series thumbnail, title, season/episode count, and an 'Original' badge, navigating to the series detail page on click.",
  "frontend/src/components/VideoCard.tsx": "A clickable card component that renders a video thumbnail with Premium and Original badges, title, and genre, navigating to the watch page on click.",
  "frontend/src/components/VideoPlayer.tsx": "A full-featured custom HTML5 video player supporting ads (pre-roll/mid-roll), autoplay with trailer or preview mode, live TV seeking, quality selection, and standard playback controls.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAuth.tsx": "Provides an AuthContext supporting Internet Identity and email login, persisting sessions in localStorage and reconciling II identity state on initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook using DFINITY's AuthClient, exposing identity, login/clear functions, and login status to the React component tree.",
  "frontend/src/hooks/useIntersectionAutoplay.ts": "Uses IntersectionObserver to track visibility of a list of elements by ref, calling a callback with the element index and visibility state when the threshold is crossed.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data (videos, series, live channels, brands, ads, user profiles, etc.) via the ICP actor.",
  "frontend/src/hooks/useSessionStorageState.ts": "A useState-like hook that persists its value in sessionStorage, initializing from storage on mount and syncing writes back to it.",
  "frontend/src/hooks/useVerticalScrollSnap.ts": "Attaches a debounced scroll listener to a container ref to calculate the snapped item index after scrolling stops and invoke an optional callback with that index.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind CSS, defines CSS custom properties for a dark red-themed design system using OKLCH colors, and provides utility classes for scrollbars, gradients, and layout.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack Query's QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabbed navigation for managing movies, podcasts, videos, clips, series, channels, live schedules, brands, ads, analytics, Stripe, and master admin settings, with a summary stats overview panel.",
  "frontend/src/pages/BrandDetailPage.tsx": "Detail page for a specific brand/network that displays the brand's logo, name, description, and its associated films, series, and clips fetched and filtered from global content queries.",
  "frontend/src/pages/ClipsPage.tsx": "Page that displays all short-form video clips in a vertical-aspect grid with hover overlays and navigates to the watch page on click.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Episode player page that resolves a series/season/episode from URL params, enforces premium access gating, selects appropriate ads for non-premium users, and renders the VideoPlayer with episode metadata.",
  "frontend/src/pages/HomePage.tsx": "Home page that composes a hero section, content rows for movies, podcasts, and originals, a clips feed, and brand rails by filtering and mapping data from multiple React Query hooks.",
  "frontend/src/pages/LivePage.tsx": "Displays a Live TV page with channel selection buttons, a video player that seeks to the current program offset, and an EPG guide grid. Auto-selects the first channel on load and uses EPG utilities to determine the current program.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login/register page supporting both Internet Identity and email/password authentication. Handles form state, error display, and redirects authenticated users to the home page.",
  "frontend/src/pages/MoviesPage.tsx": "Shows a searchable, filterable grid of movie-type VOD content fetched from the backend. Displays skeleton loaders while loading and an empty state when no results are found.",
  "frontend/src/pages/NetworksPage.tsx": "Lists all brands/networks as a responsive card grid with logo images and content counts. Clicking a card navigates to the brand's detail page.",
  "frontend/src/pages/OriginalsPage.tsx": "Displays FAITH X-Stream original content organized into tabbed categories (Films, Series, Documentaries, Educational) with skeleton loaders and empty states per tab.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple error page shown after a failed payment, with buttons to navigate home or retry via the admin page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies a Stripe session by ID after a successful payment, invalidates the user profile cache, shows a loading spinner during verification, and displays a success confirmation with navigation options.",
  "frontend/src/pages/PodcastsPage.tsx": "Displays a filterable grid of podcast videos fetched via `useGetAllVideos`, showing only non-clip VOD entries with `contentType === 'podcast'`. Includes a search bar, skeleton loading state, and an empty state message.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the authenticated user's profile information, admin status, and watch history fetched from backend queries. Handles loading, unauthenticated, and missing-profile states with appropriate fallback UI.",
  "frontend/src/pages/SearchResultsPage.tsx": "Performs a backend search using the query param `q` and displays results grouped into Films, Series, Clips, and Brands sections. Shows loading, empty, and no-query states as appropriate.",
  "frontend/src/pages/SeriesDetailPage.tsx": "Renders a detail page for a single TV series, showing a hero image, description, and an accordion list of seasons and episodes. Each episode has a play button that navigates to the episode watch route.",
  "frontend/src/pages/TVShowsPage.tsx": "Displays a searchable, responsive grid of all TV series fetched via `useGetAllSeries`. Includes skeleton loading, empty state, and client-side filtering by title or description.",
  "frontend/src/pages/UpgradePage.tsx": "Presents a premium subscription upgrade page with a feature list and a Stripe checkout flow initiated via `useCreateCheckout`. Redirects admin users away automatically and handles Stripe configuration checks before processing payment.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Page component that renders a video player for a specific content item, handling ad injection for non-premium users, premium content access gating, and loading/not-found states.",
  "frontend/src/types/index.ts": "Empty TypeScript types index file with no current exports.",
  "frontend/src/utils/contentType.ts": "Utility functions for mapping backend ContentType enum values to human-readable labels and grouping content types (e.g., movie/film, podcast).",
  "frontend/src/utils/epg.ts": "Utility functions for the Electronic Program Guide (EPG), including generating time slots, computing looping program blocks with positioning percentages, and finding the current program for a live channel.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, brand colors, border radii, box shadows, keyframe animations, and enabling the animate, typography, and container-queries plugins.",
  "project_state.json": "Project state manifest describing the media/streaming platform's features, architectural notes, known issues (admin dashboard accidentally removed), and versioned feature list being restored."
}