{
  "backend/main.mo": "Main Motoko actor defining all core data types (VideoContent, TVSeries, Episode, LiveChannel, Brand, AdMedia, Analytics, etc.) and exposing platform API endpoints for content management, access control, Stripe payments, and blob storage.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (homepage redesign, brand rails, nav redesign, etc.) to their associated source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Auto-generated JSON dictionary providing one-sentence summaries of every frontend source file, serving as a quick reference for the purpose and key details of each component and page.",
  "frontend/index.html": "Root HTML entry point for the FAITH X-Stream React app, mounting the app into a `#root` div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Defines all TanStack Router routes (home, live, movies, TV shows, podcasts, originals, clips, networks, admin, payment, etc.) and wraps the app with ThemeProvider and AuthProvider.",
  "frontend/src/components/admin/AnalyticsDashboard.tsx": "An admin dashboard component that fetches and displays platform analytics including total views, premium users, ad impressions, revenue, and trending content cards.",
  "frontend/src/components/admin/BrandManagement.tsx": "An admin component for creating, deleting, and managing brands, including uploading a logo and assigning films, series, clips, or live channels to a selected brand.",
  "frontend/src/components/admin/ChannelManagement.tsx": "Admin component for creating, editing, and deleting live TV channels, including logo upload and original channel flagging.",
  "frontend/src/components/admin/ClipsManagement.tsx": "Admin component for listing, editing captions, and deleting video clips, with indicators for auto-generated and original clips.",
  "frontend/src/components/admin/LiveScheduleManagement.tsx": "Admin component for managing live channel schedules, allowing programs to be added or removed from a selected channel's schedule.",
  "frontend/src/components/admin/ManualAdsManagement.tsx": "Admin component for uploading ad media files and managing ad assignments (scope, position, skip settings) via a tabbed interface.",
  "frontend/src/components/admin/MoviesManagement.tsx": "Admin component for uploading, editing, and deleting movie/film video content, including metadata, file uploads, and premium/original flags.",
  "frontend/src/components/admin/PodcastsManagement.tsx": "Admin component for managing podcast video content, supporting upload, edit, and delete operations with file blobs for video and thumbnail assets.",
  "frontend/src/components/admin/SeriesManagement.tsx": "Admin component for managing TV series, including CRUD operations for series, seasons, and episodes with thumbnail and trailer file uploads.",
  "frontend/src/components/admin/StripeSetup.tsx": "Admin component for configuring Stripe payment integration by entering a secret key and allowed countries, showing current configuration status.",
  "frontend/src/components/admin/VideoManagement.tsx": "Admin component for managing non-clip video content with support for uploading, editing, and deleting videos along with metadata like genre, roles, and release year.",
  "frontend/src/components/BrandRail.tsx": "Horizontally scrollable brand/network rail component that displays a brand logo header linking to BrandDetailPage, followed by a carousel of associated VideoCard and SeriesCard items.",
  "frontend/src/components/ClipsShortsFeed.tsx": "A vertical scroll-snapping feed component that displays short video clips with thumbnail backgrounds, play buttons, and metadata overlays. Uses intersection observer for autoplay detection and navigates to the watch page on click.",
  "frontend/src/components/ContentRow.tsx": "A horizontally scrollable row of video or series cards with left/right navigation arrows and an optional 'See All' button. Differentiates between VideoContent and TVSeries items to render the appropriate card component.",
  "frontend/src/components/ContextualModal.tsx": "A reusable dialog modal that displays contextual messages with type-specific icons (info, coming-soon, under-construction, feature-preview). Supports an optional action button alongside a close button.",
  "frontend/src/components/Footer.tsx": "Site footer with navigation links grouped into Browse, More, and Account sections, plus branding and a copyright notice. Uses TanStack Router for client-side navigation.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with desktop nav links, search overlay, mobile menu, and a profile dropdown supporting login/logout and admin detection. Uses TanStack Router, React Query, and auth hooks.",
  "frontend/src/components/HeroSection.tsx": "A full-width hero banner that auto-rotates through featured content items, playing a preview video or showing a thumbnail with gradient overlays. Provides Play and More Info buttons that navigate to the appropriate watch or series page.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps all pages with a Header, Footer, and ProfileSetupModal, rendering child routes via TanStack Router's Outlet.",
  "frontend/src/components/live/LiveGuideGrid.tsx": "Displays a scrollable EPG-style program guide grid showing live channels and their scheduled program blocks over the next 3 hours with a current-time indicator.",
  "frontend/src/components/LiveTVSyncPlayer.tsx": "File is empty with no implementation.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts Internet Identity users to provide an email address to complete their profile setup. Currently, the submit action is a placeholder since backend profile updates are not yet supported.",
  "frontend/src/components/SeriesCard.tsx": "A clickable card component that displays a TV series thumbnail, title, season/episode count, and badges (Original), navigating to the series detail page on click.",
  "frontend/src/components/VideoCard.tsx": "A clickable card component that displays a video thumbnail, title, genre, and Premium/Original badges, navigating to the watch page on click.",
  "frontend/src/components/VideoPlayer.tsx": "A full-featured custom HTML5 video player supporting ads (pre-roll/mid-roll), autoplay with trailer or preview mode, live TV seeking, quality selection, and standard playback controls.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useAuth.tsx": "Provides an AuthContext and AuthProvider supporting both Internet Identity and email/password authentication, with session restoration from localStorage, error normalization, and logout logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an InternetIdentityProvider and useInternetIdentity hook that manages DFINITY AuthClient lifecycle, login/logout, and identity persistence for Internet Identity authentication.",
  "frontend/src/hooks/useIntersectionAutoplay.ts": "Custom hook that uses IntersectionObserver to track visibility of a list of DOM elements and fires a callback when each item crosses a configurable visibility threshold.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering videos, clips, series, live channels, brands, ads, analytics, user profiles, and Stripe.",
  "frontend/src/hooks/useSessionStorageState.ts": "A useState-like hook that persists and restores its value from sessionStorage using a given key.",
  "frontend/src/hooks/useVerticalScrollSnap.ts": "Custom hook that listens to scroll events on a container ref and fires a callback with the snapped item index after scrolling stops, enabling vertical scroll-snap behavior.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, defines CSS custom properties for the dark brand theme (reds, surfaces), and provides utility classes for scrollbars and gradients.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that checks caller admin status and renders a tabbed interface for managing movies, podcasts, videos, clips, series, channels, live schedules, brands, ads, analytics, and Stripe settings.",
  "frontend/src/pages/BrandDetailPage.tsx": "Displays a brand's detail page including its logo, description, and associated films, series, and clips fetched via React Query hooks. Shows loading skeletons and a 'not found' fallback as needed.",
  "frontend/src/pages/ClipsPage.tsx": "Renders a grid of short video clips in a 9:16 aspect ratio with hover overlays and play buttons, navigating to the watch page on click. Shows skeletons while loading and an empty state if no clips exist.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Episode player page that resolves a specific episode from series/season/episode URL params and renders a VideoPlayer with ad injection based on user premium status. Handles locked premium content with an upgrade prompt.",
  "frontend/src/pages/HomePage.tsx": "Home page that composes a hero section, content rows (movies, podcasts, originals, continue watching), brand rails, and a clips feed using memoized data derived from videos, series, and brands queries. Shows full-page skeletons while loading.",
  "frontend/src/pages/LivePage.tsx": "Live TV page that lists available channels as selectable buttons, plays the current program via VideoPlayer with live seek offset, and renders an EPG guide grid below. Auto-selects the first channel on load.",
  "frontend/src/pages/LoginPage.tsx": "Login/registration page with tabs for email-based login and sign-up, plus an Internet Identity button for decentralized auth. Redirects authenticated users to the home page and displays error messages on failure.",
  "frontend/src/pages/MoviesPage.tsx": "Displays a filterable grid of VOD movies (films, documentaries) with genre filter chips, loading skeletons, and an empty state.",
  "frontend/src/pages/NetworksPage.tsx": "Lists all brands/networks as clickable logo cards in a grid, navigating to individual brand pages on click.",
  "frontend/src/pages/OriginalsPage.tsx": "Shows platform-original content (series, films, documentaries, educational) organized in tabbed sections with loading skeletons.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple error page shown after a failed payment, with buttons to go home or retry.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies a Stripe session after successful payment, invalidates user profile cache, and shows a confirmation screen with navigation options.",
  "frontend/src/pages/PodcastsPage.tsx": "Displays a filterable grid of podcast-type VOD content with genre chips, loading skeletons, and an empty state.",
  "frontend/src/pages/ProfilePage.tsx": "Shows the authenticated user's profile info, subscription/admin badges, and watch history, redirecting unauthenticated users to home.",
  "frontend/src/pages/SearchResultsPage.tsx": "Displays search results fetched from the backend actor, categorized into films, series, clips, and brands, with loading and empty-state handling.",
  "frontend/src/pages/SeriesDetailPage.tsx": "Shows a series hero image, metadata, and an accordion list of seasons and episodes with play navigation for each episode.",
  "frontend/src/pages/TVShowsPage.tsx": "Lists all TV series in a responsive grid with genre filter chips and skeleton loading states, fetching data via useGetAllSeries.",
  "frontend/src/pages/UpgradePage.tsx": "Renders a premium upgrade page with free vs. premium plan comparison and initiates a Stripe checkout session; redirects admin users away automatically.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Fetches a video by ID and renders the VideoPlayer with ad injection logic based on user premium/admin status, plus a paywall prompt for locked content.",
  "frontend/src/types/index.ts": "Empty file reserved for shared TypeScript type definitions.",
  "frontend/src/utils/contentType.ts": "Provides helper functions to convert ContentType enum values to display labels and to check or group content types (movie/film, podcast, etc.).",
  "frontend/src/utils/epg.ts": "Provides utility functions and types for an Electronic Program Guide (EPG), including generating time slots for the grid header, computing program blocks with positioning percentages for a channel's schedule, and finding the current program for a live channel.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and cleaning URL parameters from both query strings and hash-based routing, using sessionStorage for cross-navigation persistence and history.replaceState to remove sensitive params from the address bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts, a brand color palette (dark red/black theme), border radii, box shadows, keyframe animations, and plugins (tailwindcss-animate, typography, container-queries) for the frontend.",
  "project_state.json": "Tracks the overall project state (version 35) for a video streaming platform, documenting the current summary, architectural decisions, known bugs, and a list of existing features with their implementation status."
}