{
  "kind": "build_request",
  "title": "Update footer tagline and fix Profile Setup flow",
  "projectName": "FAITH X-Stream",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the footer tagline paragraph (located at XPath /html[1]/body[1]/div[1]/div[1]/footer[1]/div[1]/div[1]/div[1]/p[1]) to read: Community streaming for the whole family, Watch Movies, TV Shows, Live TV, and Much More.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Community streaming for the whole family, Watch Movies, TV Shows, Live TV, and Much More.",
          "Update the footer tagline to read Community streaming for the whole family, Watch Movies, TV Shows, Live TV, and Much More."
        ]
      },
      "acceptanceCriteria": [
        "The footer paragraph text exactly reads: Community streaming for the whole family, Watch Movies, TV Shows, Live TV, and Much More.",
        "No other footer content or layout is changed."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix the Set Up Profile flow in ProfileSetupModal.tsx: ensure the modal appears correctly for authenticated Internet Identity users who have not completed their profile, that all form fields such as email are functional and submit properly, and that the modal dismisses and does not re-appear after successful profile setup.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fix the Set up Profile"
        ]
      },
      "acceptanceCriteria": [
        "The Profile Setup modal appears when an authenticated Internet Identity user has not set up their profile.",
        "The email field accepts input and the form submits without errors.",
        "After successful submission the modal closes and does not reappear on subsequent page loads for the same user.",
        "If the user is not authenticated or already has a profile, the modal does not appear."
      ]
    }
  ],
  "constraints": [
    "Do not change any other footer content, layout, or navigation links.",
    "Do not modify files listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding real video playback or content source integration.",
    "Any changes to the admin panel or other pages.",
    "Redesigning the footer layout or navigation structure."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}