{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Admin Dashboard CRUD + Manual/Auto Clips + Master Admin Premium Access",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Fix Movies management CRUD operations in admin dashboard",
      "acceptanceCriteria": [
        "Admin can fill in movie metadata fields (title, description, genre, release year, etc.) and upload video/thumbnail blobs without errors",
        "Submitted movie appears in the movies list immediately after creation",
        "Existing movies can be edited and saved successfully",
        "Movies can be deleted and are removed from the list"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/MoviesManagement.tsx",
          "operation": "modify",
          "description": "Fix the create movie form to ensure all metadata fields (title, description, genre, releaseYear) and file upload fields (videoUrl, thumbnailUrl) are correctly bound and submitted. Use ExternalBlob.fromBytes() for file uploads with progress tracking. Ensure the mutation hook correctly calls actor.addVideo() with proper VideoContent structure. Add error handling with user-facing error messages."
        },
        {
          "path": "frontend/src/components/admin/MoviesManagement.tsx",
          "operation": "modify",
          "description": "Fix the edit movie functionality to pre-populate the form with existing movie data, allow updating all fields including blobs, and call actor.updateVideo() with the correct videoId and updated VideoContent object. Ensure the mutation invalidates the 'videos' query cache on success."
        },
        {
          "path": "frontend/src/components/admin/MoviesManagement.tsx",
          "operation": "modify",
          "description": "Fix the delete movie functionality to call actor.deleteVideo() with the correct videoId and invalidate the 'videos' query cache on success. Add confirmation dialog before deletion."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit and fix useAddVideo, useUpdateVideo, and useDeleteVideo mutation hooks to ensure they call the correct backend actor methods with proper argument types, handle errors gracefully with toast notifications, and invalidate the 'videos' query on success."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix Podcasts management CRUD operations in admin dashboard",
      "acceptanceCriteria": [
        "Admin can upload podcast video and thumbnail files along with metadata without errors",
        "New podcast appears in list after creation",
        "Existing podcasts can be edited and saved",
        "Podcasts can be deleted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/PodcastsManagement.tsx",
          "operation": "modify",
          "description": "Fix the create podcast form to ensure all metadata fields and file uploads (videoUrl, thumbnailUrl) are correctly submitted using ExternalBlob.fromBytes(). Ensure the mutation calls actor.addVideo() with contentType set to ContentType.podcast. Add error handling and success feedback."
        },
        {
          "path": "frontend/src/components/admin/PodcastsManagement.tsx",
          "operation": "modify",
          "description": "Fix the edit podcast functionality to pre-populate the form, allow updating fields and blobs, and call actor.updateVideo() with the correct arguments. Ensure query cache invalidation on success."
        },
        {
          "path": "frontend/src/components/admin/PodcastsManagement.tsx",
          "operation": "modify",
          "description": "Fix the delete podcast functionality to call actor.deleteVideo() and invalidate the query cache. Add confirmation dialog."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Fix Videos management CRUD operations in admin dashboard",
      "acceptanceCriteria": [
        "Admin can upload video files and thumbnails with all metadata fields without errors",
        "New video appears in list after creation",
        "Existing videos can be edited and saved",
        "Videos can be deleted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/VideoManagement.tsx",
          "operation": "modify",
          "description": "Fix the create video form to handle all metadata fields (title, description, genre, roles, releaseYear, trailerUrl) and file uploads correctly. Ensure actor.addVideo() is called with proper VideoContent structure. Use ExternalBlob.fromBytes() for file uploads with progress tracking."
        },
        {
          "path": "frontend/src/components/admin/VideoManagement.tsx",
          "operation": "modify",
          "description": "Fix the edit video functionality to pre-populate all fields including optional trailer, allow updates, and call actor.updateVideo() correctly. Invalidate 'videos' query on success."
        },
        {
          "path": "frontend/src/components/admin/VideoManagement.tsx",
          "operation": "modify",
          "description": "Fix the delete video functionality to call actor.deleteVideo() with correct videoId and invalidate the query cache. Add confirmation dialog."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Fix Clips management CRUD with manual clip creation support",
      "acceptanceCriteria": [
        "Admin can manually create a new clip by providing a caption, selecting or uploading a source video segment, and saving it",
        "New manually created clip appears in the clips list",
        "Clip captions can be edited",
        "Clips can be deleted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ClipsManagement.tsx",
          "operation": "modify",
          "description": "Add a manual clip creation form with fields for caption (clipCaption), source video upload (videoUrl), optional thumbnail upload (thumbnailUrl), and source video ID reference (sourceVideoId). Set isClip=true and isOriginal flag as appropriate. Call actor.addVideo() with the complete VideoContent structure for the new clip."
        },
        {
          "path": "frontend/src/components/admin/ClipsManagement.tsx",
          "operation": "modify",
          "description": "Fix the edit clip functionality to allow updating the clipCaption field and call actor.updateVideo() with the updated clip data. Invalidate the 'clips' query on success."
        },
        {
          "path": "frontend/src/components/admin/ClipsManagement.tsx",
          "operation": "modify",
          "description": "Fix the delete clip functionality to call actor.deleteVideo() for the clip and invalidate the 'clips' query cache. Add confirmation dialog."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure useGetAllClips query correctly fetches clips with isClip=true. Verify that add/update/delete mutations for clips properly invalidate the 'clips' query key."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Add auto-clip generation functionality in admin dashboard",
      "acceptanceCriteria": [
        "In the Clips management section, there is a button or option to auto-generate clips from existing movies/videos",
        "Admin selects a source content item and triggers auto-clip generation",
        "Backend creates one or more clip records of 4–5 seconds from the source content",
        "Generated clips are marked as auto-generated and appear in the clips list",
        "Auto-generated clips are distinguishable from manually created clips in the UI"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ClipsManagement.tsx",
          "operation": "modify",
          "description": "Add an auto-clip generation UI section with a dropdown or search to select an existing movie or video content item. Add a 'Generate Auto-Clips' button that triggers the auto-clip generation mutation for the selected source content. Display a loading indicator during generation and show success/error messages."
        },
        {
          "path": "frontend/src/components/admin/ClipsManagement.tsx",
          "operation": "modify",
          "description": "Update the clips list display to visually distinguish auto-generated clips from manually created clips using a badge or icon. Use a flag or metadata field to identify auto-generated clips."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook useGenerateAutoClips that accepts a source content ID and calls the backend capability to generate 4-5 second clips from the source. Invalidate the 'clips' query on success and handle errors with user-facing messages."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Fix Series management CRUD operations in admin dashboard",
      "acceptanceCriteria": [
        "Admin can create a new series with all metadata, seasons, and episodes without errors",
        "Thumbnail and trailer file uploads work for series",
        "Existing series can be edited",
        "Series can be deleted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/SeriesManagement.tsx",
          "operation": "modify",
          "description": "Fix the create series form to handle all TVSeries fields including title, description, seasons array with episodes, thumbnail upload (thumbnailUrl), optional trailer upload (trailerUrl), and isOriginal flag. Use ExternalBlob.fromBytes() for file uploads. Call actor.addSeries() with complete TVSeries structure."
        },
        {
          "path": "frontend/src/components/admin/SeriesManagement.tsx",
          "operation": "modify",
          "description": "Fix the edit series functionality to pre-populate the form with existing series data including all seasons and episodes, allow updates, and call actor.updateSeries() with correct seriesId and updated TVSeries object. Invalidate 'series' query on success."
        },
        {
          "path": "frontend/src/components/admin/SeriesManagement.tsx",
          "operation": "modify",
          "description": "Fix the delete series functionality to call actor.deleteSeries() with correct seriesId and invalidate the 'series' query cache. Add confirmation dialog."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit and fix useAddSeries, useUpdateSeries, and useDeleteSeries mutation hooks to ensure correct backend calls, error handling with toast notifications, and query cache invalidation."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Fix Channels management CRUD operations in admin dashboard",
      "acceptanceCriteria": [
        "Admin can create a new channel with name, logo upload, and original-content flag without errors",
        "New channel appears in channel list after creation",
        "Existing channels can be edited",
        "Channels can be deleted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ChannelManagement.tsx",
          "operation": "modify",
          "description": "Fix the create channel form to handle name, logo upload (using ExternalBlob.fromBytes()), and isOriginal flag. Call actor.addChannel() or actor.addLiveChannel() with the correct Channel or LiveChannel structure."
        },
        {
          "path": "frontend/src/components/admin/ChannelManagement.tsx",
          "operation": "modify",
          "description": "Fix the edit channel functionality to pre-populate fields, allow updates including logo replacement, and call actor.updateChannel() or actor.updateLiveChannel() with correct arguments. Invalidate channels query on success."
        },
        {
          "path": "frontend/src/components/admin/ChannelManagement.tsx",
          "operation": "modify",
          "description": "Fix the delete channel functionality to call actor.deleteChannel() or actor.deleteLiveChannel() and invalidate the query cache. Add confirmation dialog."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit and fix mutation hooks for channels to ensure correct backend calls, error handling, and query invalidation for both Channel and LiveChannel types."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Fix Live TV management CRUD operations in admin dashboard",
      "acceptanceCriteria": [
        "Admin can add a Live TV program with an HLS stream URL and associated metadata without errors",
        "Live TV entries appear in the list after creation",
        "Live TV entries can be edited and deleted",
        "Schedules can be configured for live channels"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/LiveScheduleManagement.tsx",
          "operation": "modify",
          "description": "Fix the Live TV program creation form to accept HLS stream URL, schedule metadata (start time, duration), and associated channel. Call actor.addLiveChannel() or a schedule-specific backend capability with the correct LiveChannel or ScheduledContent structure."
        },
        {
          "path": "frontend/src/components/admin/LiveScheduleManagement.tsx",
          "operation": "modify",
          "description": "Fix the edit Live TV functionality to allow updating stream URL, schedule times, and metadata. Call the appropriate update backend capability and invalidate live channels query on success."
        },
        {
          "path": "frontend/src/components/admin/LiveScheduleManagement.tsx",
          "operation": "modify",
          "description": "Fix the delete Live TV functionality to remove programs from schedules or delete channels, calling the appropriate backend capability and invalidating the query cache. Add confirmation dialog."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit and fix mutation hooks for Live TV schedule management to ensure correct backend calls, error handling, and query cache invalidation for live channels and scheduled content."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Fix Brands management CRUD operations in admin dashboard",
      "acceptanceCriteria": [
        "Admin can create a new brand with name, logo, and description without errors",
        "Admin can assign existing content (films, series, clips, channels) to a brand",
        "Brands appear in the brand list after creation",
        "Brands can be edited and deleted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/BrandManagement.tsx",
          "operation": "modify",
          "description": "Fix the create brand form to handle name, logo upload (using ExternalBlob.fromBytes()), description, and assignment of existing films, series, clips, and live channels by their IDs. Call actor.addBrand() with the complete Brand structure."
        },
        {
          "path": "frontend/src/components/admin/BrandManagement.tsx",
          "operation": "modify",
          "description": "Fix the edit brand functionality to pre-populate all fields including assigned content arrays, allow updates, and call actor.updateBrand() with brandId and updated Brand object. Invalidate 'brands' query on success."
        },
        {
          "path": "frontend/src/components/admin/BrandManagement.tsx",
          "operation": "modify",
          "description": "Fix the delete brand functionality to call actor.deleteBrand() with correct brandId and invalidate the 'brands' query cache. Add confirmation dialog."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit and fix useAddBrand, useUpdateBrand, and useDeleteBrand mutation hooks to ensure correct backend calls, error handling with toast notifications, and query cache invalidation."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Fix Ads management CRUD operations in admin dashboard",
      "acceptanceCriteria": [
        "Admin can upload an ad media file and configure its settings without errors",
        "Ad assignment appears in the ads list after creation",
        "Existing ads can be edited and deleted"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ManualAdsManagement.tsx",
          "operation": "modify",
          "description": "Fix the ad media upload form to handle file upload (adFile using ExternalBlob.fromBytes()), metadata (description, duration, tags, language, regions, mediaType), and call actor.addAdMedia() with the complete AdMedia structure."
        },
        {
          "path": "frontend/src/components/admin/ManualAdsManagement.tsx",
          "operation": "modify",
          "description": "Fix the ad assignment creation form to configure scope (global or targeted), position, skip settings, show count, and target ID. Call actor.addAdAssignment() with the complete AdAssignment structure."
        },
        {
          "path": "frontend/src/components/admin/ManualAdsManagement.tsx",
          "operation": "modify",
          "description": "Fix the edit ad functionality to allow updating AdMedia and AdAssignment fields and call actor.updateAdMedia() and actor.updateAdAssignment() with correct IDs and updated objects. Invalidate ads queries on success."
        },
        {
          "path": "frontend/src/components/admin/ManualAdsManagement.tsx",
          "operation": "modify",
          "description": "Fix the delete ad functionality to call actor.deleteAdMedia() and actor.deleteAdAssignment() with correct IDs and invalidate the ads query cache. Add confirmation dialogs."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit and fix mutation hooks for ad media and ad assignments to ensure correct backend calls, error handling, and query cache invalidation for both AdMedia and AdAssignment types."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Fix Stripe configuration section in admin dashboard",
      "acceptanceCriteria": [
        "Admin can enter and save Stripe secret key and allowed countries without errors",
        "After saving, the Stripe configuration status is displayed correctly",
        "Stripe checkout sessions can be initiated for premium subscriptions"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/StripeSetup.tsx",
          "operation": "modify",
          "description": "Fix the Stripe configuration form to accept secret key and allowed countries array, validate inputs, and call actor.setStripeConfiguration() with the StripeConfiguration object. Display the current configuration status using actor.isStripeConfigured(). Add error handling and success feedback."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit and fix useSetStripeConfiguration mutation hook to ensure correct backend call with StripeConfiguration argument, error handling with toast notification, and invalidation of stripe configuration status query on success."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Ensure Master Admin role has full platform and premium access with ability to grant premium to other admins",
      "acceptanceCriteria": [
        "Master Admin can access all premium-gated content without a subscription",
        "Master Admin sees and can use all admin dashboard sections without restriction",
        "In the MasterAdminManagement panel, Master Admin can grant premium access to any admin user",
        "Premium access granted by Master Admin persists and allows the recipient admin to access premium content"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/MasterAdminManagement.tsx",
          "operation": "modify",
          "description": "Add a premium access grant feature in the MasterAdminManagement component. Display a list of all admin users with their current premium status. Add a button or toggle for each admin to grant or revoke premium access. Call a backend capability to update the admin user's isPremium flag in their UserProfile. Invalidate user queries on success."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a mutation hook useGrantPremiumAccess that accepts a user Principal and calls a backend capability to set isPremium=true in the user's profile. Invalidate relevant user profile queries on success and handle errors with toast notifications."
        },
        {
          "path": "frontend/src/pages/VideoPlayerPage.tsx",
          "operation": "modify",
          "description": "Update the premium content gating logic to check if the user has UserRole.masterAdmin role (via actor.getCallerFullUserRole()) and bypass subscription checks for Master Admin users, allowing them full premium access."
        },
        {
          "path": "frontend/src/pages/EpisodePlayerPage.tsx",
          "operation": "modify",
          "description": "Update the premium content gating logic to check if the user has UserRole.masterAdmin role and bypass subscription checks for Master Admin users."
        },
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Update the AuthContext and refreshRole logic to fetch the full user role including masterAdmin status from actor.getCallerFullUserRole(). Ensure the role state includes masterAdmin distinction for downstream checks."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Audit and fix all React Query mutation hooks in useQueries.ts for every admin section",
      "acceptanceCriteria": [
        "Each admin section mutation hook calls the correct backend actor function with the correct arguments",
        "On success, the relevant list query is invalidated and the UI reflects the updated data",
        "On error, a clear error message is shown to the admin user",
        "No unhandled promise rejections or silent failures in any admin CRUD operation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit all mutation hooks (useAddVideo, useUpdateVideo, useDeleteVideo, useAddSeries, useUpdateSeries, useDeleteSeries, useAddBrand, useUpdateBrand, useDeleteBrand, useAddAdMedia, useUpdateAdMedia, useDeleteAdMedia, useAddAdAssignment, useUpdateAdAssignment, useDeleteAdAssignment, useAddChannel, useUpdateChannel, useDeleteChannel, useAddLiveChannel, useUpdateLiveChannel, useDeleteLiveChannel, useSetStripeConfiguration) to ensure each calls the correct backend actor method with the exact argument types expected by backend-interface. Verify that the mutation's onSuccess callback invalidates the correct query keys (e.g., 'videos', 'clips', 'series', 'brands', 'ads', 'channels', 'liveChannels'). Ensure onError callbacks display user-facing error messages using toast notifications. Add try-catch blocks where needed to prevent unhandled rejections."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Ensure AdminPage tabbed interface includes all management sections including Clips",
      "acceptanceCriteria": [
        "AdminPage has tabs for all sections: Movies, Podcasts, Videos, Clips, Series, Channels, Live TV, Brands, Ads, Stripe, Analytics, Master Admin Management",
        "Each tab renders its corresponding management component without errors",
        "Clips tab is present and renders ClipsManagement with both manual creation and auto-clip generation options"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Verify that the AdminPage tabbed interface includes a 'Clips' tab that renders the ClipsManagement component. Ensure all other tabs (Movies, Podcasts, Videos, Series, Channels, Live TV, Brands, Ads, Stripe, Analytics, Master Admin Management) are present and correctly render their respective components. Update the tab list and tab content rendering logic if any tabs are missing or incorrectly wired."
        }
      ]
    }
  ]
}