{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update footer tagline and fix Profile Setup flow",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the footer tagline paragraph to read: Community streaming for the whole family, Watch Movies, TV Shows, Live TV, and Much More.",
      "acceptanceCriteria": [
        "The footer paragraph text exactly reads: Community streaming for the whole family, Watch Movies, TV Shows, Live TV, and Much More.",
        "No other footer content or layout is changed."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Locate the footer paragraph element and update its text content to exactly read: 'Community streaming for the whole family, Watch Movies, TV Shows, Live TV, and Much More.' Preserve all other footer structure, links, and styling."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Fix the Profile Setup flow: ensure the modal appears correctly for authenticated Internet Identity users who have not completed their profile, that all form fields function properly, and that the modal dismisses permanently after successful profile setup.",
      "acceptanceCriteria": [
        "The Profile Setup modal appears when an authenticated Internet Identity user has not set up their profile.",
        "The email field accepts input and the form submits without errors.",
        "After successful submission the modal closes and does not reappear on subsequent page loads for the same user.",
        "If the user is not authenticated or already has a profile, the modal does not appear."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Fix the ProfileSetupModal component to properly handle the profile setup flow. Ensure the modal visibility logic correctly checks authentication state and profile completion status using the useGetCallerUserProfile hook with proper loading state handling (verify the hook returns isFetched and isLoading correctly). Ensure the email input field is properly bound to form state and that form submission calls saveCallerUserProfile with the correct UserProfile structure including the email field. After successful submission, ensure the query cache is invalidated so the modal no longer appears. Verify the component's usage instructions from the authorization component are followed, particularly the pattern for preventing modal flash on load by checking both actorFetching and query states."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Review and fix the ProfileSetupModal integration in the Layout component. Ensure the modal is conditionally rendered using the correct logic: showProfileSetup should be true only when isAuthenticated is true, profile loading is complete (isFetched is true and isLoading is false), and userProfile is null. Verify that the authentication state from useAuth or useInternetIdentity is properly passed to the modal visibility check."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and fix the useGetCallerUserProfile hook implementation. Ensure it follows the authorization component's pattern for preventing profile setup modal flash: it should depend on the actor being available and not fetching (enabled: !!actor && !actorFetching), and return a custom isLoading state that combines actorFetching with query.isLoading, plus an isFetched flag that checks both actor availability and query completion. Verify the useSaveCallerUserProfile mutation correctly invalidates the 'currentUserProfile' query key on success so the modal dismisses."
        }
      ]
    }
  ]
}