{
  "backend/main.mo": "Main backend actor defining all data types (VideoContent, TVSeries, Episode, LiveChannel, Brand, AdMedia, Analytics, etc.) and implementing content management, user authentication, Stripe payment integration, blob storage, and access control functionality.",
  "feature_evidence.json": "Feature evidence report documenting four authentication-related features focused on fixing Header re-rendering, auth state propagation, profile query invalidation, and actor initialization after Internet Identity login.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, describing their functionality including authentication flows, video playback, admin panels, content management, and UI components with red/black branding.",
  "frontend/index.html": "HTML entry point for the FAITH X-Stream application with favicon and root div for React mounting.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all routes (home, live, originals, movies, series, admin, payment, etc.), wrapped with AuthProvider and ThemeProvider, including search route with validated query parameters.",
  "frontend/src/components/admin/AnalyticsDashboard.tsx": "Admin dashboard displaying platform analytics including total views, premium user count, ad impressions, subscription revenue, trending content by category, and category-specific statistics with visual cards and icons.",
  "frontend/src/components/admin/BrandManagement.tsx": "Admin interface for creating, editing, and deleting brands with logo uploads, and assigning content (films, series, clips, live channels) to brands for organization and categorization.",
  "frontend/src/components/admin/ChannelManagement.tsx": "Admin panel for managing live TV channels with CRUD operations, logo uploads, and an 'isOriginal' flag to mark original content channels.",
  "frontend/src/components/admin/ClipsManagement.tsx": "Admin interface for managing video clips with edit/delete capabilities, displaying clip captions, source video references, and indicators for auto-generated and original content.",
  "frontend/src/components/admin/LiveScheduleManagement.tsx": "Admin component for managing live TV channel schedules, allowing users to add/remove scheduled content with time slots and mark programs as originals.",
  "frontend/src/components/admin/ManualAdsManagement.tsx": "Admin component for uploading ad media files and creating ad assignments with configurable scope, position, show count, and skip settings.",
  "frontend/src/components/admin/MoviesManagement.tsx": "Admin component for uploading and managing movie content with metadata (title, description, genre, release year), supporting premium/original flags and live/VOD eligibility.",
  "frontend/src/components/admin/PodcastsManagement.tsx": "Admin component for uploading and managing podcast content with video/thumbnail files, supporting premium/original flags and live/VOD availability settings.",
  "frontend/src/components/admin/SeriesManagement.tsx": "Admin component for managing TV series with hierarchical season and episode structure, supporting thumbnails, trailers, and premium/original content flags.",
  "frontend/src/components/admin/StripeSetup.tsx": "Admin component for configuring Stripe payment integration with secret key and allowed countries input, showing configuration status with success/error toasts.",
  "frontend/src/components/admin/VideoManagement.tsx": "Admin component for managing video content with upload, edit, and delete functionality, supporting metadata like content type, premium status, live eligibility, and file uploads for video, trailer, and thumbnail.",
  "frontend/src/components/ClipsShortsFeed.tsx": "Vertical scrolling shorts feed component displaying clips in full-viewport snap-scroll layout with thumbnail backgrounds, play button overlays, and intersection observer for autoplay support.",
  "frontend/src/components/ContextualModal.tsx": "Reusable modal component supporting four types (info, coming-soon, under-construction, feature-preview) with corresponding icons, customizable title/description, and optional action button.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright info, caffeine.ai credit, and links (Privacy, Terms, Contact) that open a ContextualModal with placeholder content.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, desktop/mobile nav menus, search bar, and user authentication controls (login/logout, profile dropdown, admin link).",
  "frontend/src/components/HeroSection.tsx": "Hero banner component that displays a featured video with thumbnail, title, description, and action buttons (Play Now, More Info), with optional autoplay preview.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that renders Header, main content outlet, Footer, and ProfileSetupModal for all pages.",
  "frontend/src/components/live/LiveGuideGrid.tsx": "EPG (Electronic Program Guide) component displaying a scrollable grid of live channels and their program schedules for the next 3 hours with current time indicator and channel selection.",
  "frontend/src/components/LiveTVSyncPlayer.tsx": "Live TV player that syncs with backend channel state, handles program transitions, ad insertion at markers, and maintains playback position across content changes.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts Internet Identity users to complete their profile by adding an email address (currently a placeholder without backend support).",
  "frontend/src/components/SeriesCard.tsx": "Card component displaying TV series thumbnail, title, description, season/episode counts, and original badge, navigating to series detail page on click.",
  "frontend/src/components/VideoCard.tsx": "Card component for individual video content with thumbnail, play overlay on hover, premium/original badges, and content type label, navigating to watch page on click.",
  "frontend/src/components/VideoPlayer.tsx": "A comprehensive video player component with ad support (pre-roll, mid-roll, post-roll), live TV functionality, premium content handling, autoplay/preview modes, quality selection, and full playback controls including seek, volume, and fullscreen.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.tsx": "Authentication context provider supporting both Internet Identity and email/password login methods, with session restoration, error normalization, and unified authentication state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using @dfinity/auth-client, managing identity state, login flow, and session persistence with configurable options.",
  "frontend/src/hooks/useIntersectionAutoplay.ts": "Hook using IntersectionObserver to detect when elements become visible in viewport, triggering callbacks for autoplay functionality based on configurable visibility threshold.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating data from the backend actor, including videos, series, live channels, brands, ads, analytics, user profiles, shopping, and Stripe configuration.",
  "frontend/src/hooks/useSessionStorageState.ts": "Custom React hook that manages state persisted in sessionStorage, providing a useState-like interface with automatic serialization and deserialization.",
  "frontend/src/hooks/useVerticalScrollSnap.ts": "Custom React hook that implements vertical scroll snap behavior with debounced scroll-end detection and optional callback for the current scroll index.",
  "frontend/src/index.css": "Global CSS with Tailwind directives, OKLCH color system for light/dark modes, deep red-to-black gradient background, custom scrollbar styling, and animation utilities.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabbed interface for managing movies, podcasts, videos, clips, series, channels, live schedules, brands, ads, analytics, and Stripe setup; requires admin authentication.",
  "frontend/src/pages/BrandDetailPage.tsx": "Brand detail page displaying brand information, logo, and associated content (films, series, clips) organized in grid layouts with loading states.",
  "frontend/src/pages/ClipsPage.tsx": "Page displaying all clips in a vertical grid with thumbnails, hover overlays, and navigation to watch individual clips.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Displays a video player for TV series episodes with ad support, premium content gating, and navigation back to the series page. Handles authentication checks, premium user detection, and conditionally shows ads based on user status and ad assignments.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a carousel slideshow of videos, series, and sponsored ads with auto-play previews, plus sections for clips/shorts, featured brands, and content grids. Implements auto-cycling slideshow with video/image preview support and navigation to various content types.",
  "frontend/src/pages/LivePage.tsx": "Live TV page with two modes: a synchronized channel player view and a TV guide grid view. Manages channel selection with session storage, displays channel listings, and handles premium user access for live streaming content.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page with tabbed interface for email login/registration and Internet Identity admin login. Handles form validation, password confirmation, and redirects authenticated users to the home page.",
  "frontend/src/pages/MoviesPage.tsx": "Displays a grid of movie content filtered from all videos by content type (movie/film) and VOD availability. Simple layout with Film icon header and responsive grid of VideoCard components.",
  "frontend/src/pages/NetworksPage.tsx": "Displays a grid of network brands with logos, descriptions, and channel counts. Each brand card is clickable and navigates to a detailed brand page showing its content.",
  "frontend/src/pages/OriginalsPage.tsx": "Displays FAITH X-Stream original content organized in tabs (All, Films, Series, Documentaries, Educational) with filtering by content type and original status. Uses VideoCard and SeriesCard components to render filtered videos and series.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with an error icon and provides buttons to return home or retry payment via the admin page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe payment session on mount, invalidates user profile cache to refresh premium status, and displays success message with navigation options to home or profile.",
  "frontend/src/pages/ProfilePage.tsx": "Displays authenticated user profile with premium/admin badges, watch history with resume functionality, and subscription management options. Redirects unauthenticated users to home.",
  "frontend/src/pages/SearchResultsPage.tsx": "Performs search via actor backend and displays categorized results (Films, Series, Clips, Brands) using VideoCard and SeriesCard components. Shows loading, empty query, and no results states.",
  "frontend/src/pages/SeriesDetailPage.tsx": "Displays series details with hero banner, description, and accordion of seasons/episodes. Provides navigation to episode watch page and back to TV shows listing.",
  "frontend/src/pages/TVShowsPage.tsx": "Lists all available TV series in a grid layout using SeriesCard components with loading and empty states.",
  "frontend/src/pages/UpgradePage.tsx": "Premium subscription upgrade page that displays free vs premium plan comparison, handles Stripe checkout session creation for $9.99/month subscription, and redirects admin users who have automatic premium access.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Video player page component that fetches video content by ID, determines ad display based on user premium status, and renders the VideoPlayer with appropriate ads or shows premium-locked content message.",
  "frontend/src/types/index.ts": "Empty TypeScript types file, likely a placeholder for shared type definitions.",
  "frontend/src/utils/contentType.ts": "Utility functions for ContentType enum handling, including label formatting, type checking predicates, and helper functions to filter movie/film and podcast content types.",
  "frontend/src/utils/epg.ts": "Electronic Program Guide (EPG) utilities that generate time slots, calculate program blocks with positioning for live channel schedules, handle schedule looping, and determine current playing programs with playback offsets.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with hash-based and browser routing, including functions to extract, persist, and clear parameters from URLs and sessionStorage for state management across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme including sidebar colors, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking a video streaming platform with admin dashboard, documenting architectural decisions for FAST/Live TV channels, VOD content management, ad insertion, and auto-clip generation. Contains known issues including autoplay freezing, UI bugs, video update failures, Live TV playback restarting incorrectly, and post-login UI state problems."
}