{
  "backend/main.mo": "Defines the main actor and all content-related types for videos, series, episodes, live channels, ads, brands, and analytics.",
  "backend/migration.mo": "Provides old/new type definitions and migration logic for upgrading content structures, including expanded ContentType variants.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all frontend files for documentation or build planning.",
  "frontend/index.html": "HTML entry point defining root mount element and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global providers, and ties all pages into the app’s navigation structure.",
  "frontend/src/components/admin/AnalyticsDashboard.tsx": "Displays analytics stats and trending content fetched from useGetAnalytics, with loading skeletons and cards for views, users, impressions, and revenue.",
  "frontend/src/components/admin/BrandManagement.tsx": "Provides UI to create, update, delete brands and assign films, series, clips, or live channels using various query hooks.",
  "frontend/src/components/admin/ChannelManagement.tsx": "Creates, edits, and deletes live channels with name, logo upload, and original-status flags using live channel query hooks.",
  "frontend/src/components/admin/ClipsManagement.tsx": "Manages clip creation, editing, and deletion with video and thumbnail uploads, metadata fields, and premium/original flags.",
  "frontend/src/components/admin/LiveScheduleManagement.tsx": "Manages adding and removing scheduled programs for live channels by selecting videos and updating channel schedules.",
  "frontend/src/components/admin/ManualAdsManagement.tsx": "UI and logic for uploading ad media, creating ad assignments, and deleting existing ads using query hooks.",
  "frontend/src/components/admin/MoviesManagement.tsx": "Manages movie uploads and edits, handling video files, thumbnails, metadata, and CRUD operations through query hooks.",
  "frontend/src/components/admin/PodcastsManagement.tsx": "Handles podcast upload and editing with video and thumbnail files, metadata fields, and update/delete actions via query hooks.",
  "frontend/src/components/admin/SeriesManagement.tsx": "Provides creation and management of TV series, seasons, and episodes with file uploads and metadata editing.",
  "frontend/src/components/admin/StripeSetup.tsx": "Sets up or updates Stripe configuration by submitting API keys and allowed countries, showing current config state.",
  "frontend/src/components/admin/VideoManagement.tsx": "Admin UI for uploading, editing, and deleting videos with file handling, form state, and backend mutations.",
  "frontend/src/components/ContextualModal.tsx": "Reusable modal component supporting multiple icon types, actions, and stylized dialog layout.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding and interactive links that open a contextual modal with preset info content.",
  "frontend/src/components/Header.tsx": "Implements the main header with navigation, search, user actions, and responsive mobile menu handling.",
  "frontend/src/components/HeroSection.tsx": "Displays a large hero banner with autoplaying video preview, branding, and buttons to play or view more info.",
  "frontend/src/components/Layout.tsx": "Defines the app layout structure with header, footer, routed content, and the profile setup modal.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a modal prompting Internet Identity users to enter an email and saves the updated profile.",
  "frontend/src/components/SeriesCard.tsx": "Clickable card showing a series thumbnail, metadata, and navigation to the series detail page.",
  "frontend/src/components/VideoCard.tsx": "Displays a video content card with thumbnail, metadata, premium/original badges, and navigation to the watch page.",
  "frontend/src/components/VideoPlayer.tsx": "Custom video player supporting ads, autoplay previews, quality controls, and user interaction handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAuth.tsx": "Provides authentication context supporting email/password and Internet Identity, including session restore logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login, logout, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating videos, user profiles, admin checks, and related backend data.",
  "frontend/src/index.css": "Tailwind-based global styles defining light/dark themes, gradients, animations, and scrollbar customization.",
  "frontend/src/main.tsx": "Application entry point initializing React, Internet Identity provider, and React Query client.",
  "frontend/src/pages/AdminPage.tsx": "Admin-only panel that loads admin status and displays tabbed management sections for videos, clips, series, channels, live TV, brands, ads, and analytics.",
  "frontend/src/pages/BrandDetailPage.tsx": "Fetches brand details and associated content, then displays films, series, and clips for a selected brand with loading and not-found states.",
  "frontend/src/pages/ClipsPage.tsx": "Lists all clips with thumbnails and navigation to the watch page, showing skeletons while loading.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Loads a specific series episode, checks access rules, and plays the episode with ads depending on user status.",
  "frontend/src/pages/HomePage.tsx": "Builds a featured slideshow from videos, series, and ads, and displays general content sections once data loads.",
  "frontend/src/pages/LivePage.tsx": "Provides live TV playback by selecting channels and computing the current program loop, inserting ads for non‑premium users.",
  "frontend/src/pages/LoginPage.tsx": "Implements login and registration UI with form validation, redirects, and authentication handlers.",
  "frontend/src/pages/MoviesPage.tsx": "Fetches all videos, filters movies, and displays them with loading skeletons.",
  "frontend/src/pages/NetworksPage.tsx": "Loads and displays network brands as clickable cards with skeletons for loading.",
  "frontend/src/pages/OriginalsPage.tsx": "Displays original videos and series with category tabs and loading states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with navigation options to retry or go home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe session status, updates profile, and shows success UI with navigation options.",
  "frontend/src/pages/ProfilePage.tsx": "Displays user profile, premium/admin status, and watch history after authentication checks.",
  "frontend/src/pages/SearchResultsPage.tsx": "Searches content by query, fetches results, and displays categorized cards with loading and empty states.",
  "frontend/src/pages/SeriesDetailPage.tsx": "Fetches and displays detailed series info including seasons, episodes, and metadata with loading and error handling.",
  "frontend/src/pages/TVShowsPage.tsx": "Loads all TV series and displays them in a grid with a loading skeleton and empty-state fallback.",
  "frontend/src/pages/UpgradePage.tsx": "Handles premium upgrade flow using Stripe, redirects admins, and shows feature list with checkout handling.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Displays video playback with ads based on user premium status and handles loading, not-found, and access states.",
  "frontend/src/types/index.ts": "Placeholder file with no content.",
  "frontend/src/utils/contentType.ts": "Utility functions for mapping and checking content types such as movies, films, podcasts, and series.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters and sessionStorage-backed values.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, container settings, animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Project state describing a video platform, outlining issues in autoplay/UI/admin flows and listing feature requirements for video playback and content‑type handling."
}