{
  "backend/main.mo": "Defines the main actor with extensive content, media, ad, analytics, and access‑related type definitions used across the backend.",
  "backend/migration.mo": "Contains legacy type definitions and a no‑op migration function mapping old actor data to the new actor format.",
  "feature_evidence.json": "Lists feature evidence records linking features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files describing their purpose and behavior.",
  "frontend/index.html": "Base HTML entry point that loads the React application and sets page metadata and favicon.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, defines all application routes, and wraps the app with AuthProvider and theme support.",
  "frontend/src/components/admin/AnalyticsDashboard.tsx": "Displays analytics stats, trending content, and category data using fetched analytics, with loading and empty states.",
  "frontend/src/components/admin/BrandManagement.tsx": "Provides UI for creating, deleting, updating brands and assigning content types to brands, including logo upload.",
  "frontend/src/components/admin/ChannelManagement.tsx": "Manages creation, editing, and deletion of live channels with logo upload and original-content settings.",
  "frontend/src/components/admin/ClipsManagement.tsx": "Handles uploading, editing, and deleting video clips with file uploads, metadata editing, and progress tracking.",
  "frontend/src/components/admin/LiveScheduleManagement.tsx": "Allows admins to add and remove scheduled programs for live channels by assigning videos to channel schedules.",
  "frontend/src/components/admin/ManualAdsManagement.tsx": "UI for uploading ad media and creating or deleting ad assignments, including file handling and backend mutations.",
  "frontend/src/components/admin/MoviesManagement.tsx": "Provides movie upload and editing functionality with video, thumbnail, and optional trailer handling, along with metadata management.",
  "frontend/src/components/admin/PodcastsManagement.tsx": "Manages podcast uploads and edits, handling video and thumbnail files and updating podcast metadata.",
  "frontend/src/components/admin/SeriesManagement.tsx": "Admin interface for creating and editing TV series, seasons, and episodes, including file uploads and metadata configuration.",
  "frontend/src/components/admin/StripeSetup.tsx": "UI for viewing and setting Stripe configuration, allowing entry of secret keys and allowed countries with backend updates.",
  "frontend/src/components/admin/VideoManagement.tsx": "Admin UI for uploading, editing, and deleting videos with file handling, metadata fields, and react-query mutations.",
  "frontend/src/components/ContextualModal.tsx": "Reusable modal component showing contextual messages with icons, descriptions, and optional action buttons.",
  "frontend/src/components/Footer.tsx": "Footer with branding links and modal-triggering links for privacy, terms, and contact info.",
  "frontend/src/components/Header.tsx": "Header with navigation, search, auth actions, and mobile menu using router state and user profile queries.",
  "frontend/src/components/HeroSection.tsx": "Hero banner that autoplays a video preview and provides play and info navigation actions.",
  "frontend/src/components/Layout.tsx": "Page layout wrapper combining header, footer, routed content, and profile setup modal.",
  "frontend/src/components/live/LiveGuideGrid.tsx": "Renders a scrollable TV guide grid showing channels and program blocks, auto-scrolling to the current time.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting Internet Identity users to complete their profile by adding an email.",
  "frontend/src/components/SeriesCard.tsx": "Clickable card displaying series artwork, metadata, and season/episode counts.",
  "frontend/src/components/VideoCard.tsx": "Clickable video card showing thumbnail, metadata, premium/original badges, and content type label.",
  "frontend/src/components/VideoPlayer.tsx": "Custom video player with autoplay, preview mode, ads, quality selection, and control overlay logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.tsx": "Central authentication provider handling email/password and Internet Identity login, session restoration, and auth state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Wraps Dfinity AuthClient to manage Internet Identity login, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for backend operations including videos, profiles, admin checks, and related mutations.",
  "frontend/src/hooks/useSessionStorageState.ts": "Custom hook for persisting state in sessionStorage with JSON serialization.",
  "frontend/src/index.css": "Defines Tailwind layers, OKLCH color themes for light/dark mode, base styles, animations, and custom scrollbar styling.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider, then renders the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Loads admin access state and renders an admin dashboard with tabbed management panels; shows loading or access denied states.",
  "frontend/src/pages/BrandDetailPage.tsx": "Fetches brand details and associated content, displaying films, series, and clips for a specific brand with loading and not-found states.",
  "frontend/src/pages/ClipsPage.tsx": "Displays all clip content in a grid with skeleton loading and navigation to individual clip playback pages.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Loads a specific episode, determines access/ads, and renders the video player with episode details or fallbacks if unavailable.",
  "frontend/src/pages/HomePage.tsx": "Builds a homepage featuring videos, series, brands, and ad media, including an auto-cycling featured slideshow with preview playback.",
  "frontend/src/pages/LivePage.tsx": "Handles live TV viewing with channel selection, program updates, and guide mode using various queries and timers.",
  "frontend/src/pages/LoginPage.tsx": "Provides login and registration forms with email or Internet Identity authentication and redirects after success.",
  "frontend/src/pages/MoviesPage.tsx": "Displays all non-clip videos as movies with loading skeletons and grid layout.",
  "frontend/src/pages/NetworksPage.tsx": "Fetches and lists brands with logos and descriptions, allowing navigation to brand-specific pages.",
  "frontend/src/pages/OriginalsPage.tsx": "Shows original films, series, documentaries, and educational videos with tabbed filtering.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with options to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe session status, updates user premium state, and displays a payment success screen.",
  "frontend/src/pages/ProfilePage.tsx": "Renders the authenticated user's profile, badges, and watch history while redirecting unauthenticated users home. Fetches profile, admin status, videos, series, and history, then maps watched items to their content details.",
  "frontend/src/pages/SearchResultsPage.tsx": "Executes search queries based on URL parameters and displays categorized results for videos, series, clips, and brands. Shows loading, empty, and results states with appropriate UI sections.",
  "frontend/src/pages/SeriesDetailPage.tsx": "Loads a series by ID and displays its hero section plus seasons and episodes with metadata. Handles loading, not-found states, and content-type labeling.",
  "frontend/src/pages/TVShowsPage.tsx": "Fetches all series and displays them in a responsive grid. Shows skeleton loading placeholders and a fallback if no series exist.",
  "frontend/src/pages/UpgradePage.tsx": "Displays premium subscription features and starts a Stripe checkout session unless the user is an admin. Handles loading, redirects, and payment initiation with error toasts.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Loads and plays a selected video with optional ads based on user premium status. Handles premium gating, ad assignment, loading, and missing video states.",
  "frontend/src/types/index.ts": "Empty placeholder file for shared type exports.",
  "frontend/src/utils/contentType.ts": "Provides helpers to label content types and determine category groupings like movies and podcasts. Maps backend ContentType enums to readable strings.",
  "frontend/src/utils/epg.ts": "Generates EPG time slots and computes program blocks for looped live-channel schedules, including positioning and current-program detection.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme colors, container settings, animations, and plugins like typography and container queries.",
  "project_state.json": "Project state description summarizing architecture notes, known issues, and existing feature requests for a video streaming app."
}