{
  "backend/main.mo": "Main backend actor defining all data types (VideoContent, TVSeries, Episode, LiveChannel, Brand, AdMedia, Analytics, etc.) and implementing CRUD operations, authentication, Stripe payment integration, blob storage, and access control for a streaming platform.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features related to Internet Identity login integration, including UI button addition, authentication flow wiring, actor initialization, profile query refetching, and proper navigation after login.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, describing routing setup, authentication flow, video player features, admin panel, content management, and UI styling with red/black theme.",
  "frontend/index.html": "HTML entry point for the FAITH X-Stream application with favicon reference and root div for React mounting.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with 17 routes (home, live, originals, movies, TV shows, clips, networks, admin, payment, search, login, etc.), wrapped with AuthProvider and ThemeProvider.",
  "frontend/src/components/admin/AnalyticsDashboard.tsx": "Displays analytics dashboard with stats cards (views, premium users, ad impressions, revenue), trending content list, and category statistics. Uses useGetAnalytics hook and renders loading/empty states.",
  "frontend/src/components/admin/BrandManagement.tsx": "Manages brands with creation form (name, description, logo upload), deletion, and content assignment functionality across films, series, clips, and live channels. Uses multiple query hooks for brands and content types.",
  "frontend/src/components/admin/ChannelManagement.tsx": "Handles live TV channel CRUD operations with form for creating/editing channels (name, logo, isOriginal flag) and delete functionality. Includes edit dialog and uses channel-specific query hooks.",
  "frontend/src/components/admin/ClipsManagement.tsx": "Manages video clips with edit dialog for updating clip captions and delete functionality. Displays clips with thumbnails, shows auto-generated indicators, and links to source videos.",
  "frontend/src/components/admin/LiveScheduleManagement.tsx": "Manages live TV channel schedules by adding/removing scheduled programs with start/end times and isOriginal flags. Uses dialog for program creation and displays eligible videos for scheduling.",
  "frontend/src/components/admin/ManualAdsManagement.tsx": "Admin component for managing ad media uploads (video/image) and ad assignments with targeting options (global/channel/video), including duration, tags, language, regions, and display settings like skip-after and free-only flags.",
  "frontend/src/components/admin/MoviesManagement.tsx": "Admin component for uploading and managing movie content with metadata (title, description, genre, release year, roles), supporting premium/original flags, live/VOD eligibility, and file uploads for video, trailer, and thumbnail with progress tracking.",
  "frontend/src/components/admin/PodcastsManagement.tsx": "Admin component for managing podcast content with basic metadata (title, description), premium/original flags, live/VOD eligibility, and video/thumbnail uploads with edit and delete functionality.",
  "frontend/src/components/admin/SeriesManagement.tsx": "Admin component for managing TV series with hierarchical structure (series > seasons > episodes), supporting metadata, thumbnails, trailers, and episode-level properties like runtime, premium status, and first-episode flags.",
  "frontend/src/components/admin/StripeSetup.tsx": "Admin component for configuring Stripe payment integration by entering secret key and allowed countries, displaying configuration status with success indicators.",
  "frontend/src/components/admin/VideoManagement.tsx": "Admin component for managing video content with forms to add/edit videos, including file uploads (video, trailer, thumbnail), metadata fields (title, description, genre, etc.), and content flags (premium, original, live-eligible). Displays a list of existing videos with edit and delete actions.",
  "frontend/src/components/ClipsShortsFeed.tsx": "Vertical scrolling shorts feed component with snap behavior, intersection observer for autoplay tracking, and click-to-play navigation for clip content with thumbnail overlays and Original badges.",
  "frontend/src/components/ContextualModal.tsx": "Reusable modal dialog component supporting four types (info, coming-soon, under-construction, feature-preview) with custom icons, descriptions, and optional action buttons styled with red gradient theme.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright, caffeine.ai attribution, and links to Privacy Policy, Terms of Service, and Contact that open modals with placeholder content.",
  "frontend/src/components/Header.tsx": "Header component with logo, navigation links (Home, Movies, TV Shows, Originals, Live TV, Clips, Networks), search bar, and user dropdown menu with profile/admin/logout options.",
  "frontend/src/components/HeroSection.tsx": "Hero section component that displays a featured video with thumbnail, title, description, and action buttons (Play Now, More Info), transitioning to VideoPlayer with autoplay preview.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Header, page content via Outlet, Footer, and ProfileSetupModal in a flex column structure.",
  "frontend/src/components/live/LiveGuideGrid.tsx": "Displays an electronic program guide (EPG) grid showing live TV channels and their scheduled programs over a 3-hour window. Features a fixed channel column, scrollable time slots, a current-time indicator, and click-to-select channel functionality.",
  "frontend/src/components/LiveTVSyncPlayer.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for Internet Identity users to complete their profile by adding an email address, shown when user profile lacks email (backend update not yet implemented).",
  "frontend/src/components/SeriesCard.tsx": "Card component displaying TV series thumbnail, title, description, season/episode count, and original badge, navigating to series detail page on click.",
  "frontend/src/components/VideoCard.tsx": "Card component for video content with thumbnail, play overlay on hover, premium/original badges, title, description, and content type label, navigating to watch page on click.",
  "frontend/src/components/VideoPlayer.tsx": "Full-featured video player with playback controls, ad support (preroll/midroll/postroll), live TV sync, quality selection, preview/autoplay modes, and premium content handling.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically recreates the actor when identity changes and invalidates/refetches dependent queries.",
  "frontend/src/hooks/useAuth.tsx": "Provides unified authentication context supporting both Internet Identity (admin) and email/password (regular users). Manages authentication state, login/logout flows, session persistence, and coordinates between II and email auth methods.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication using @dfinity/auth-client. Manages identity lifecycle, login flow, session persistence, and provides authentication status states.",
  "frontend/src/hooks/useIntersectionAutoplay.ts": "Custom hook using IntersectionObserver to detect when elements become visible in the viewport. Used for triggering autoplay behavior based on element visibility with configurable threshold.",
  "frontend/src/hooks/useQueries.ts": "Centralized React Query hooks for all backend API calls including user profiles, authentication, videos, TV series, live channels, brands, ads, analytics, search, payments (Stripe), and shopping. Handles query caching, mutations, and cache invalidation.",
  "frontend/src/hooks/useSessionStorageState.ts": "Custom React hook that manages state persisted in sessionStorage with JSON serialization, providing a useState-like interface with automatic storage synchronization.",
  "frontend/src/hooks/useVerticalScrollSnap.ts": "React hook that implements vertical scroll snapping behavior with debounced scroll detection and optional callback when scrolling ends at a specific index.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind configuration, OKLCH color system for light/dark modes with deep red/black theme, custom scrollbar styling, and animation utilities with reduced motion support.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient, InternetIdentityProvider, and renders the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with access control that displays tabbed management interfaces for movies, podcasts, videos, clips, series, channels, live schedules, brands, ads, analytics, and Stripe setup.",
  "frontend/src/pages/BrandDetailPage.tsx": "Brand detail page that displays brand information with logo, description, and filtered content (films, series, clips) associated with the brand's channels.",
  "frontend/src/pages/ClipsPage.tsx": "Page displaying a grid of video clips with hover effects, play buttons, and navigation to individual clip player pages.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Episode player page with premium access control, ad integration based on user subscription status, and navigation back to series detail page.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a featured content slideshow (videos, series, ads), horizontal scrollable sections for clips/shorts, videos, series, and brands, with auto-playing video previews and navigation to detail pages.",
  "frontend/src/pages/LivePage.tsx": "Live TV page with channel selection buttons, a video player that seeks to the current program's offset, and an EPG (Electronic Program Guide) grid showing scheduled programming.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page with tabs for login/register using email/password or Internet Identity, redirects authenticated users to home, and displays loading states during authentication.",
  "frontend/src/pages/MoviesPage.tsx": "Displays a grid of all available movies filtered by content type (movie/film) and VOD availability.",
  "frontend/src/pages/NetworksPage.tsx": "Shows a grid of all brands/networks with logos, descriptions, and channel counts, navigating to individual brand detail pages on click.",
  "frontend/src/pages/OriginalsPage.tsx": "Displays FAITH X-Stream original content organized in tabs by category (all, films, series, documentaries, educational) with filtered grids of videos and series.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple error page displayed when payment processing fails, with buttons to return home or retry payment.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Success page that verifies Stripe payment session status, invalidates user profile cache to refresh premium status, and displays confirmation with navigation options.",
  "frontend/src/pages/ProfilePage.tsx": "Displays authenticated user profile with account details, premium/admin badges, and watch history. Redirects unauthenticated users to home.",
  "frontend/src/pages/SearchResultsPage.tsx": "Renders search results page that queries the backend actor and displays categorized results (films, series, clips, brands) using VideoCard and SeriesCard components.",
  "frontend/src/pages/SeriesDetailPage.tsx": "Shows series detail page with hero image, description, and accordion of seasons/episodes with play buttons that navigate to episode player.",
  "frontend/src/pages/TVShowsPage.tsx": "Displays a grid of all available TV series using SeriesCard components fetched via useGetAllSeries hook.",
  "frontend/src/pages/UpgradePage.tsx": "Premium subscription upgrade page that creates Stripe checkout sessions for $9.99/month premium plan. Redirects admin users who already have premium access.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Video player page that renders VideoPlayer component with ad injection logic based on user premium status and ad assignments (video-specific or global).",
  "frontend/src/types/index.ts": "Empty TypeScript types file with no content.",
  "frontend/src/utils/contentType.ts": "Utility functions for ContentType enum handling: label conversion, type checking (movie/film, podcast), and type filtering helpers.",
  "frontend/src/utils/epg.ts": "Provides EPG (Electronic Program Guide) utilities for generating time slots and program blocks for live TV channels, including functions to calculate program positioning, handle schedule looping, and determine current program playback offsets.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a video streaming platform with admin dashboard, Live TV/FAST channels with EPG, VOD content management, ad scheduling, and known issues including autoplay freezing, UI bugs, and missing login button after rollback."
}