{
  "backend/main.mo": "Main actor defining all data types (VideoContent, TVSeries, Episode, LiveChannel, Brand, AdMedia, Analytics, etc.) and implementing CRUD operations, access control, Stripe integration, blob storage, and migration support for a streaming platform backend.",
  "backend/migration.mo": "Migration module that upgrades VideoContent records by adding three new fields: availableAsVOD (defaulting to true), sourceVideoId, and clipCaption for existing videos during canister upgrade.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features related to adding eligibleForLive and availableAsVOD checkboxes to admin forms and filtering VOD content display across frontend pages.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, describing authentication flows, video playback, admin management interfaces, live TV scheduling, and content filtering logic.",
  "frontend/index.html": "HTML entry point for the FAITH X-Stream application with favicon and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with all route definitions (home, live, originals, movies, series, admin, payment, etc.), wrapped with AuthProvider and ThemeProvider.",
  "frontend/src/components/admin/AnalyticsDashboard.tsx": "Displays analytics dashboard with stats cards (views, premium users, ad impressions, revenue), trending content list, and category statistics. Uses useGetAnalytics hook and renders loading/empty states.",
  "frontend/src/components/admin/BrandManagement.tsx": "Manages brands with creation form (name, description, logo upload), deletion, and content assignment functionality. Allows assigning films, series, clips, and live channels to brands using tabs and multi-select interface.",
  "frontend/src/components/admin/ChannelManagement.tsx": "Handles live TV channel CRUD operations including creation with logo upload, editing via dialog, and deletion. Supports marking channels as originals and displays channel list with edit/delete actions.",
  "frontend/src/components/admin/ClipsManagement.tsx": "Manages video clips with edit dialog for updating clip captions and delete functionality. Displays clips with thumbnails, shows auto-generated and original badges, and links to source videos.",
  "frontend/src/components/admin/LiveScheduleManagement.tsx": "Manages live TV channel schedules by adding/removing scheduled content with start/end times. Provides dialog for selecting eligible videos and marking programs as originals, with validation for time ranges.",
  "frontend/src/components/admin/ManualAdsManagement.tsx": "Admin component for managing ad media uploads (video/image files with metadata) and ad assignments (targeting, positioning, skip settings) with separate tabs for media library and assignment configuration.",
  "frontend/src/components/admin/MoviesManagement.tsx": "Admin component for uploading and managing movie content with fields for title, description, content type, premium/original flags, video/trailer/thumbnail files, roles, genre, release year, and live/VOD eligibility with edit and delete capabilities.",
  "frontend/src/components/admin/PodcastsManagement.tsx": "Admin component for managing podcast content with upload forms for video and thumbnail files, premium/original flags, live/VOD settings, and edit/delete functionality for existing podcasts.",
  "frontend/src/components/admin/SeriesManagement.tsx": "Admin component for managing TV series with nested season and episode management, including series metadata, thumbnails, trailers, and dialogs for adding/editing seasons and episodes with their own video files and settings.",
  "frontend/src/components/admin/StripeSetup.tsx": "Admin component for configuring Stripe payment integration by entering secret key and allowed countries, displaying configuration status with visual feedback for whether Stripe is already set up.",
  "frontend/src/components/admin/VideoManagement.tsx": "Admin component for managing video content with forms to add/edit videos, including file uploads (video, trailer, thumbnail), metadata fields, and content type/premium/live eligibility settings. Displays a list of non-clip videos with edit and delete actions.",
  "frontend/src/components/ContextualModal.tsx": "Reusable modal component supporting four types (info, coming-soon, under-construction, feature-preview) with dynamic icons, descriptions, and optional action buttons.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright, caffeine.ai attribution, and links (Privacy, Terms, Contact) that open contextual modals with placeholder content.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, desktop/mobile nav menus, search bar, and user authentication controls (login/logout, profile dropdown, admin link).",
  "frontend/src/components/HeroSection.tsx": "Hero banner component that displays a featured video with thumbnail, title, description, and action buttons (Play Now, More Info), transitioning to VideoPlayer on load.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that renders Header, main content outlet, Footer, and ProfileSetupModal for all pages.",
  "frontend/src/components/live/LiveGuideGrid.tsx": "Displays an EPG-style program guide grid showing live TV channels and their scheduled programs over a 3-hour window. Features a fixed channel column, scrollable time slots, and a current time indicator that auto-scrolls into view.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts Internet Identity users to complete their profile by entering an email address if missing.",
  "frontend/src/components/SeriesCard.tsx": "Card component displaying TV series thumbnail, title, description, season/episode counts, and original badge; navigates to series detail page on click.",
  "frontend/src/components/VideoCard.tsx": "Card component for video content with thumbnail, play overlay on hover, premium/original badges, and content type label; navigates to watch page on click.",
  "frontend/src/components/VideoPlayer.tsx": "Full-featured video player with custom controls (play/pause, seek, volume, fullscreen, quality selection), ad playback support, autoplay/preview modes, and live TV functionality with seek tokens.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.tsx": "Authentication context provider supporting both Internet Identity and email/password login methods. Manages authentication state, session restoration from localStorage, and provides login/logout functions with normalized error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication using @dfinity/auth-client. Manages identity state, login flow, session persistence, and provides authentication status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend API calls including user profiles, videos, clips, live channels, TV series, ads, shopping, analytics, and admin operations. Handles authentication requirements and caching strategies per query type.",
  "frontend/src/hooks/useSessionStorageState.ts": "Custom React hook that provides useState-like interface with automatic sessionStorage persistence. Handles JSON serialization/deserialization and error recovery.",
  "frontend/src/index.css": "Tailwind CSS configuration with OKLCH color system for light/dark modes, featuring a deep red to black gradient theme. Includes custom scrollbar styling, animations, and reduced motion support.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabbed interface for managing movies, podcasts, clips, series, channels, live TV, brands, ads, analytics, and Stripe setup. Includes admin permission check.",
  "frontend/src/pages/BrandDetailPage.tsx": "Displays detailed view of a brand/network including its logo, description, and associated films, series, and clips. Fetches brand data and filters content by brand channels.",
  "frontend/src/pages/ClipsPage.tsx": "Grid view page displaying all short-form video clips with vertical aspect ratio (9:16). Each clip shows thumbnail with hover overlay containing play button and title.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Episode video player page that handles premium content access control, displays episode metadata, and integrates ads for non-premium users. Includes navigation back to series.",
  "frontend/src/pages/HomePage.tsx": "Main landing page with auto-cycling featured content slideshow (videos, series, ads) that supports video/image previews. Displays content organized by categories with horizontal scrolling.",
  "frontend/src/pages/LivePage.tsx": "Displays live TV channels with EPG (electronic program guide), supports watch and guide modes, handles program scheduling with ad locations, and includes premium user detection for ad-free viewing.",
  "frontend/src/pages/LoginPage.tsx": "Provides authentication UI with tabs for email login/registration and Internet Identity login, includes form validation, and redirects authenticated users to home page.",
  "frontend/src/pages/MoviesPage.tsx": "Displays a grid of movie content filtered by ContentType (movie/film) that is available as VOD, excluding clips.",
  "frontend/src/pages/NetworksPage.tsx": "Shows a grid of brands/networks with logos and channel counts, allowing navigation to individual brand detail pages.",
  "frontend/src/pages/OriginalsPage.tsx": "Displays FAITH X-Stream original content organized by tabs (all, films, series, documentaries, educational) with separate grids for series and videos.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Simple error page displayed when payment processing fails, offering navigation back to home or retry options.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe payment session on load, invalidates user profile cache to refresh premium status, and displays success message with navigation options.",
  "frontend/src/pages/ProfilePage.tsx": "Displays authenticated user profile with account details, premium/admin badges, and watch history. Redirects unauthenticated users to home.",
  "frontend/src/pages/SearchResultsPage.tsx": "Renders search results grouped by type (films, series, clips, brands) using query parameter 'q' and displays appropriate cards for each result type.",
  "frontend/src/pages/SeriesDetailPage.tsx": "Shows TV series details with hero image, description, and accordion of seasons/episodes with play buttons for each episode.",
  "frontend/src/pages/TVShowsPage.tsx": "Lists all available TV series in a grid layout using SeriesCard components.",
  "frontend/src/pages/UpgradePage.tsx": "Premium subscription upgrade page with feature list and Stripe checkout integration; redirects admin users who already have premium access.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Video playback page that handles premium content access control, ad injection for non-premium users, and displays video metadata.",
  "frontend/src/types/index.ts": "Empty TypeScript types file, likely a placeholder for shared type definitions.",
  "frontend/src/utils/contentType.ts": "Utility functions for ContentType enum handling, including label generation and type checking helpers for movies, films, and podcasts.",
  "frontend/src/utils/epg.ts": "Provides EPG (Electronic Program Guide) utilities for generating time slots and program blocks for live TV channels, including functions to calculate program positioning, handle schedule looping, and determine current program playback offset.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, animations (accordion), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a video streaming platform with admin dashboard, Live TV/FAST channels with EPG, VOD content management, ad scheduling, dual availability toggles (Live TV vs standalone VOD), and known issues including autoplay freezing and login failures."
}