{
  "backend/main.mo": "Defines core data types for content, ads, analytics, brands, channels, and media within the backend actor.",
  "feature_evidence.json": "Lists feature evidence mapping features to affected files, components, and test IDs for two live playback fixes.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for various frontend files describing UI behavior, routing, and admin features.",
  "frontend/index.html": "HTML entry point loading the React application and favicon.",
  "frontend/src/App.tsx": "Sets up all application routes using TanStack Router and wraps the app with AuthProvider and ThemeProvider.",
  "frontend/src/components/admin/AnalyticsDashboard.tsx": "Admin dashboard showing key analytics stats, trending content, and loading skeletons.",
  "frontend/src/components/admin/BrandManagement.tsx": "UI for creating, deleting, and updating brands, including logo upload and assigning films, series, clips, and live channels.",
  "frontend/src/components/admin/ChannelManagement.tsx": "Manages live channels with create, edit, update, and delete actions, including logo handling and original-content flag.",
  "frontend/src/components/admin/ClipsManagement.tsx": "Handles uploading, editing, and deleting clip-type video content with video/thumbnail blobs and metadata settings.",
  "frontend/src/components/admin/LiveScheduleManagement.tsx": "Allows assigning and removing scheduled video programs on live channels, updating each channel’s schedule.",
  "frontend/src/components/admin/ManualAdsManagement.tsx": "Supports uploading ad media files and creating or deleting ad assignments with configurable targeting and playback options.",
  "frontend/src/components/admin/MoviesManagement.tsx": "Admin UI for uploading, editing, and deleting movie/film videos with metadata, thumbnails, trailers, and progress tracking.",
  "frontend/src/components/admin/PodcastsManagement.tsx": "Admin UI for managing podcast uploads and edits, handling video and thumbnail files with premium/original flags.",
  "frontend/src/components/admin/SeriesManagement.tsx": "Admin interface for creating and editing TV series, seasons, and episodes including media uploads and metadata.",
  "frontend/src/components/admin/StripeSetup.tsx": "Form for configuring and updating Stripe payment credentials with validation and status display.",
  "frontend/src/components/admin/VideoManagement.tsx": "General video management tool for uploading, editing, and deleting non-clip videos with metadata and media files.",
  "frontend/src/components/ContextualModal.tsx": "Reusable modal component that displays contextual info with configurable types, icons, and actions.",
  "frontend/src/components/Footer.tsx": "Footer with branding and clickable links that open contextual modals for privacy, terms, and contact info.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, search, auth controls, mobile menu, and user/admin profile logic.",
  "frontend/src/components/HeroSection.tsx": "Displays a hero banner with autoplaying preview or video player, branding, title, description, and action buttons.",
  "frontend/src/components/Layout.tsx": "Wraps the app with header, footer, outlet content area, and profile setup modal.",
  "frontend/src/components/live/LiveGuideGrid.tsx": "Renders a scrollable EPG-style grid showing channels, time slots, and current-time positioning. Handles automatic scrolling, channel selection, and display layout with badges and icons.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting Internet Identity users to submit their email and save profile data.",
  "frontend/src/components/SeriesCard.tsx": "Clickable series card showing thumbnail, description, seasons, episodes, and original badge.",
  "frontend/src/components/VideoCard.tsx": "Clickable video card displaying thumbnail, metadata, content type, and premium/original indicators.",
  "frontend/src/components/VideoPlayer.tsx": "Advanced custom video player with autoplay, ads, preview mode, quality options, controls, and live seek logic.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the identity changes. Provides the current actor and fetching state.",
  "frontend/src/hooks/useAuth.tsx": "Implements global authentication state for email-password and Internet Identity, including session restoration and login/logout flows. Exposes auth status, errors, and helper actions.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity restoration using Dfinity AuthClient. Manages identity state, login status, and error handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data like profiles, videos, channels, and admin status. Integrates with the actor and auth state for conditional querying.",
  "frontend/src/hooks/useSessionStorageState.ts": "A hook that syncs React state with sessionStorage for persistence across page reloads. Supports safe JSON parsing and writing.",
  "frontend/src/index.css": "Defines Tailwind base styles and a deep red/black theme with gradients, custom colors, animations, and scrollbar styling. Sets global background and typography rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers, rendering the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin panel with permission checks, loading state, and tabbed management sections for videos, clips, series, channels, live, brands, ads, and analytics.",
  "frontend/src/pages/BrandDetailPage.tsx": "Fetches and displays a brand's details along with its associated films, series, and clips, handling loading and missing-brand states.",
  "frontend/src/pages/ClipsPage.tsx": "Loads and displays all clips in a responsive grid with skeleton loading and navigation to individual clip playback.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Finds and plays a specific episode with ad logic, authentication checks, and fallbacks for missing episode data.",
  "frontend/src/pages/HomePage.tsx": "Builds a dynamic homepage featuring videos, series, brands, and ads with an auto-rotating featured slideshow and loading states.",
  "frontend/src/pages/LivePage.tsx": "Displays live TV channels with program tracking, schedule-based playback, ad logic, and a watch/guide mode toggle.",
  "frontend/src/pages/LoginPage.tsx": "Login and registration page handling email auth, II admin login, validation, and redirects.",
  "frontend/src/pages/MoviesPage.tsx": "Fetches all videos, filters non-clips as movies, and displays them with loading skeletons.",
  "frontend/src/pages/NetworksPage.tsx": "Loads brand data and displays network cards with navigation to individual brand pages.",
  "frontend/src/pages/OriginalsPage.tsx": "Shows original films, series, documentaries, and educational videos with tab filtering.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with options to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe session, updates premium status, and shows a success screen with navigation options.",
  "frontend/src/pages/ProfilePage.tsx": "Shows authenticated user profile, premium/admin badges, and reconstructed watch history.",
  "frontend/src/pages/SearchResultsPage.tsx": "Fetches search results, filters them by type, and displays loading states, empty states, and categorized results.",
  "frontend/src/pages/SeriesDetailPage.tsx": "Loads a series by ID, shows a hero section with metadata, and lists seasons and episodes with loading and not-found handling.",
  "frontend/src/pages/TVShowsPage.tsx": "Retrieves and displays all TV series with loading placeholders and a fallback when none exist.",
  "frontend/src/pages/UpgradePage.tsx": "Handles premium upgrade flow using Stripe, redirects admins, and renders a feature list with checkout processing.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Loads video data, determines premium access, resolves ads, and renders the video player with access control and fallbacks.",
  "frontend/src/types/index.ts": "Provides an empty module placeholder for shared types.",
  "frontend/src/utils/contentType.ts": "Utility helpers for mapping and checking content types, including movie/film and podcast categorization.",
  "frontend/src/utils/epg.ts": "Generates time slots and computes program blocks for an EPG, including looping schedules and current program detection.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), persist them in sessionStorage, and clear them from URL or storage.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom color variables, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Describes project state, architecture notes, known issues, and planned features for a video streaming platform with admin and live TV components."
}