{
  "backend/main.mo": "Main backend actor defining all data types (VideoContent, TVSeries, Episode, LiveChannel, Brand, AdMedia, Analytics, etc.) and implementing comprehensive content management, user authentication, subscription handling via Stripe, blob storage integration, and access control for a streaming platform.",
  "feature_evidence.json": "Feature evidence report documenting four authentication-related features with high confidence: fixing auth state propagation, ensuring actor initialization, invalidating profile queries after login, and removing LiveTVSyncPlayer interference with authentication flow.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages, describing authentication flows, video players, admin panels, content management, live TV functionality, and UI components with their specific behaviors and styling.",
  "frontend/index.html": "HTML entry point for the FAITH X-Stream application with favicon reference and root div mounting point for React.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all routes (home, live, originals, movies, series, admin, payment, etc.), wrapped with AuthProvider and ThemeProvider, including search route with validated query parameters.",
  "frontend/src/components/admin/AnalyticsDashboard.tsx": "Admin analytics dashboard displaying key metrics (total views, premium users, ad impressions, revenue) and trending content organized by category with icons and view counts.",
  "frontend/src/components/admin/BrandManagement.tsx": "Admin interface for creating, editing, and deleting brands with logo uploads, and assigning content (films, series, clips, live channels) to brands.",
  "frontend/src/components/admin/ChannelManagement.tsx": "Admin interface for managing live TV channels with CRUD operations, logo uploads, and original channel designation toggle.",
  "frontend/src/components/admin/ClipsManagement.tsx": "Admin interface for managing video clips with edit/delete capabilities, caption editing, and display of auto-generated clips with source video references.",
  "frontend/src/components/admin/LiveScheduleManagement.tsx": "Admin component for managing live TV channel schedules, allowing users to add/remove scheduled content with time slots and mark programs as originals.",
  "frontend/src/components/admin/ManualAdsManagement.tsx": "Admin component for uploading ad media files and creating ad assignments with targeting options (global/specific), position, skip settings, and free-tier restrictions.",
  "frontend/src/components/admin/MoviesManagement.tsx": "Admin component for uploading and managing movie content with metadata (title, description, genre, release year), supporting premium/original flags, live TV eligibility, and VOD availability.",
  "frontend/src/components/admin/PodcastsManagement.tsx": "Admin component for uploading and managing podcast content with basic metadata, premium/original flags, and live TV/VOD availability settings.",
  "frontend/src/components/admin/SeriesManagement.tsx": "Admin component for managing TV series with hierarchical structure (series > seasons > episodes), supporting metadata, thumbnails, trailers, and premium/original content flags.",
  "frontend/src/components/admin/StripeSetup.tsx": "Admin component for configuring Stripe payment integration with secret key and allowed countries input, showing configuration status and handling form submission.",
  "frontend/src/components/admin/VideoManagement.tsx": "Admin component for managing video content with upload, edit, and delete functionality, supporting metadata like content type, premium status, live eligibility, and file uploads for video, trailer, and thumbnail.",
  "frontend/src/components/ClipsShortsFeed.tsx": "Vertical scrolling shorts feed component displaying clips with snap-scroll behavior, intersection observer autoplay support, thumbnail overlays, play buttons, and Original badges, navigating to full player on click.",
  "frontend/src/components/ContextualModal.tsx": "Reusable modal dialog component supporting four types (info, coming-soon, under-construction, feature-preview) with corresponding icons, customizable title/description, optional action button, and gradient-styled UI.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright, caffeine.ai attribution, and links to privacy/terms/contact that open a ContextualModal with placeholder content.",
  "frontend/src/components/Header.tsx": "Header component with logo, navigation links, and authentication UI that shows login/signup buttons or user dropdown with profile/admin/logout options based on auth state.",
  "frontend/src/components/HeroSection.tsx": "Hero section component that displays a featured video with thumbnail, title, description, and action buttons; auto-plays video preview after thumbnail loads.",
  "frontend/src/components/Layout.tsx": "Root layout component that wraps Header, main content outlet, Footer, and ProfileSetupModal in a flex column structure.",
  "frontend/src/components/live/LiveGuideGrid.tsx": "EPG (Electronic Program Guide) component displaying a scrollable grid of live channels and their scheduled programs over a 3-hour window with current time indicator.",
  "frontend/src/components/LiveTVSyncPlayer.tsx": "Live TV video player that syncs playback position with server state every 7 seconds, correcting drift over 3 seconds and notifying parent of program changes.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts Internet Identity users to complete their profile by adding an email address (currently non-functional placeholder).",
  "frontend/src/components/SeriesCard.tsx": "Card component for TV series that displays thumbnail, title, description, season/episode counts, and navigates to series detail page on click.",
  "frontend/src/components/VideoCard.tsx": "Card component for video content that displays thumbnail with play overlay on hover, premium/original badges, and navigates to watch page on click.",
  "frontend/src/components/VideoPlayer.tsx": "A comprehensive video player component with ad support (preroll, midroll, postroll), premium features (quality selection, live TV seeking), preview/trailer autoplay, and full playback controls including volume, fullscreen, and time scrubbing.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with Internet Identity authentication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.tsx": "Authentication context provider supporting both Internet Identity and email/password authentication methods, managing auth state, login/logout flows, and session restoration.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider for Internet Identity authentication using @dfinity/auth-client, managing identity state, login flow, and session persistence with configurable options.",
  "frontend/src/hooks/useIntersectionAutoplay.ts": "Custom hook using IntersectionObserver to detect when elements become visible in viewport, triggering callbacks for autoplay functionality based on visibility threshold.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user authentication, video/series/channel/brand management, analytics, shopping, and Stripe integration. Exports custom hooks like useGetCallerUserProfile, useGetAllVideos, useCreateVideo, etc., with proper query invalidation and actor dependency handling.",
  "frontend/src/hooks/useSessionStorageState.ts": "Provides a custom React hook that manages state persisted in sessionStorage, similar to useState but with automatic serialization/deserialization and error handling.",
  "frontend/src/hooks/useVerticalScrollSnap.ts": "Custom hook that implements vertical scroll snapping behavior with debounced scroll detection and optional callback when scrolling ends at a specific index.",
  "frontend/src/index.css": "Global styles using Tailwind with OKLCH color system for light/dark modes featuring a deep red and black theme for FAITH X-Stream. Includes custom scrollbar styling, animations, and gradient backgrounds.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabbed interface for managing movies, podcasts, videos, clips, series, channels, live schedules, brands, ads, analytics, and Stripe configuration. Includes admin access control check.",
  "frontend/src/pages/BrandDetailPage.tsx": "Displays a brand's detail page with logo, description, and categorized content (films, series, clips) from associated channels. Includes loading states and empty state handling.",
  "frontend/src/pages/ClipsPage.tsx": "Grid view page displaying all clips/shorts in vertical aspect ratio cards with hover effects showing play button and title overlay. Includes loading skeletons and empty state.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Displays a video player for TV series episodes with ad support, premium content gating, and navigation back to the series page. Handles authentication checks, premium user status, and conditionally shows ads based on user tier and episode-specific or global ad assignments.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a carousel slideshow of videos, series, and sponsored ads with auto-play video previews. Displays categorized content sections including clips/shorts feed, featured videos, TV series, and brand networks with horizontal scrolling.",
  "frontend/src/pages/LivePage.tsx": "Live TV streaming page with channel selection, synchronized playback via LiveTVSyncPlayer, and an EPG (Electronic Program Guide) grid. Handles authentication state and actor initialization before rendering the player.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page with tabbed interface for email/password login and registration, plus Internet Identity integration. Automatically redirects authenticated users to the home page and includes form validation with toast notifications.",
  "frontend/src/pages/MoviesPage.tsx": "Displays a grid of movie content filtered from all videos by content type (movie/film) and VOD availability. Simple layout with Film icon header and loading state.",
  "frontend/src/pages/NetworksPage.tsx": "Shows a grid of brand/network cards with logos, descriptions, and channel counts. Each card is clickable and navigates to the brand's detail page.",
  "frontend/src/pages/OriginalsPage.tsx": "Displays FAITH X-Stream original content (videos and series) organized in tabs by category (all, films, series, documentaries, educational). Filters content by isOriginal flag and contentType, rendering VideoCard and SeriesCard components in responsive grids.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with an XCircle icon and provides buttons to return home or retry payment via the admin page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe payment session on mount, invalidates user profile query to refresh premium status, and displays success message with navigation options to home or profile.",
  "frontend/src/pages/ProfilePage.tsx": "Displays authenticated user profile with premium/admin badges, watch history with resume functionality, and subscription management. Redirects unauthenticated users to home.",
  "frontend/src/pages/SearchResultsPage.tsx": "Performs search via actor.search() and displays results grouped by type (films, series, clips, brands) using VideoCard and SeriesCard components in responsive grids.",
  "frontend/src/pages/SeriesDetailPage.tsx": "Shows series detail page with hero image, description, and accordion of seasons/episodes. Each episode has a play button that navigates to the watch-episode route.",
  "frontend/src/pages/TVShowsPage.tsx": "Displays all TV series in a responsive grid using SeriesCard components, with a TV icon header and loading/empty states.",
  "frontend/src/pages/UpgradePage.tsx": "React page component for premium subscription upgrade flow, integrating Stripe checkout with admin bypass logic and displaying feature comparison between free and premium tiers.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Video player page component that handles premium content access control, ad assignment logic based on user subscription status, and displays video metadata with back navigation.",
  "frontend/src/types/index.ts": "Empty TypeScript types index file.",
  "frontend/src/utils/contentType.ts": "Utility functions for mapping ContentType enum values to human-readable labels and filtering content by type (movies, films, podcasts).",
  "frontend/src/utils/epg.ts": "Electronic Program Guide (EPG) utilities for generating time slots, calculating program blocks with positioning for live TV channels, and determining current program playback offsets with schedule looping logic.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both standard query strings and hash-based routing, with sessionStorage persistence for maintaining state like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme tokens for UI components (sidebar, chart, card), container queries, typography, and animation plugins.",
  "project_state.json": "Project state file tracking a video streaming platform with admin dashboard, documenting architectural decisions for FAST/Live TV channels, VOD content management, ad insertion, and auto-clip generation. Lists known issues including broken autoplay, UI bugs, failed video updates, Live TV playback restarting, and broken authentication."
}