{
  "backend/main.mo": "Main backend actor defining all data types (VideoContent, TVSeries, Episode, LiveChannel, Brand, AdMedia, Analytics, etc.) and implementing core business logic for content management, user profiles, subscriptions, live TV scheduling, ad assignments, and Stripe payment integration.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features for LiveTVSyncPlayer component: creation of synchronized player, drift detection/correction, LivePage integration, and program transition handling with associated test IDs and component dependencies.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components and pages including App.tsx with TanStack Router setup, LivePage with LiveTVSyncPlayer integration, admin panels, video players, and content management interfaces.",
  "frontend/index.html": "HTML entry point for the FAITH X-Stream application with favicon and root div for React mounting.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with all routes (home, live, originals, movies, series, admin, payment, etc.), wrapped with AuthProvider and ThemeProvider, including search route with validated query parameters.",
  "frontend/src/components/admin/AnalyticsDashboard.tsx": "Admin dashboard displaying platform analytics including total views, premium user count, ad impressions, subscription revenue, trending content by category, and category-specific statistics with visual cards and icons.",
  "frontend/src/components/admin/BrandManagement.tsx": "Admin interface for creating, editing, and deleting brands with logo uploads, and assigning content (films, series, clips, live channels) to brands for organization and categorization.",
  "frontend/src/components/admin/ChannelManagement.tsx": "Admin interface for managing live TV channels including creation, editing, deletion, and marking channels as originals, with logo upload support and channel listing display.",
  "frontend/src/components/admin/ClipsManagement.tsx": "Admin interface for managing video clips with editing capabilities for clip captions, deletion functionality, and display of auto-generated clips with their source video references and original content badges.",
  "frontend/src/components/admin/LiveScheduleManagement.tsx": "Admin component for managing live TV channel schedules, allowing users to add/remove scheduled content with time slots and mark programs as originals.",
  "frontend/src/components/admin/ManualAdsManagement.tsx": "Admin component for uploading ad media files and creating ad assignments with configurable scope, position, show count, and skip settings.",
  "frontend/src/components/admin/MoviesManagement.tsx": "Admin component for uploading and managing movie content with metadata (title, description, genre, release year), supporting premium/original flags and live TV/VOD eligibility.",
  "frontend/src/components/admin/PodcastsManagement.tsx": "Admin component for uploading and managing podcast content with basic metadata, premium/original flags, and live TV/VOD availability settings.",
  "frontend/src/components/admin/SeriesManagement.tsx": "Admin component for managing TV series with hierarchical structure (series → seasons → episodes), supporting metadata, thumbnails, and premium/original content flags.",
  "frontend/src/components/admin/StripeSetup.tsx": "Admin component for configuring Stripe payment integration with secret key and allowed countries input, displaying configuration status with success/error toasts.",
  "frontend/src/components/admin/VideoManagement.tsx": "Admin component for managing video content with upload, edit, and delete functionality, supporting metadata like content type, premium status, live eligibility, and file uploads for video, trailer, and thumbnail.",
  "frontend/src/components/ClipsShortsFeed.tsx": "Vertical scrolling shorts feed component for clips with snap-scroll behavior, intersection observer for autoplay tracking, thumbnail overlays, play buttons, and navigation to full clip player.",
  "frontend/src/components/ContextualModal.tsx": "Reusable modal dialog component supporting four types (info, coming-soon, under-construction, feature-preview) with customizable icons, titles, descriptions, and optional action buttons.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright info, caffeine.ai attribution, and links (Privacy, Terms, Contact) that open a ContextualModal with placeholder content.",
  "frontend/src/components/Header.tsx": "Main navigation header with logo, desktop/mobile nav menus, search bar, and user authentication controls (login/logout, profile dropdown, admin link).",
  "frontend/src/components/HeroSection.tsx": "Hero banner component that displays a featured video with thumbnail, title, description, and action buttons (Play Now, More Info), with optional autoplay preview.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that renders Header, main content outlet, Footer, and ProfileSetupModal for all pages.",
  "frontend/src/components/live/LiveGuideGrid.tsx": "EPG-style program guide component displaying live channels and their scheduled content in a scrollable grid with time slots, auto-scrolling to current time on mount.",
  "frontend/src/components/LiveTVSyncPlayer.tsx": "Live TV player that syncs with backend channel state, handles program transitions, ad playback at markers, and periodically re-syncs playback position.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts Internet Identity users to complete their profile by adding an email address (placeholder implementation).",
  "frontend/src/components/SeriesCard.tsx": "Card component displaying a TV series thumbnail, title, description, season/episode count, and original badge; navigates to series detail on click.",
  "frontend/src/components/VideoCard.tsx": "Card component for individual video content with thumbnail, play overlay on hover, premium/original badges, and content type label; navigates to watch page on click.",
  "frontend/src/components/VideoPlayer.tsx": "A comprehensive video player component with ad support (pre-roll, mid-roll, post-roll), live TV functionality, premium content handling, autoplay/preview modes, quality selection, and full playback controls including seek, volume, and fullscreen.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with Internet Identity authentication, automatically invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.tsx": "Authentication context provider supporting both Internet Identity and email/password login methods, with session restoration, error normalization, and unified authentication state management.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider for Internet Identity authentication using @dfinity/auth-client, managing identity state, login flow, and session persistence with configurable options.",
  "frontend/src/hooks/useIntersectionAutoplay.ts": "Custom hook using IntersectionObserver to detect when elements become visible in viewport, triggering callbacks for autoplay functionality based on configurable visibility threshold.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating data from the backend actor, including videos, series, live channels, brands, ads, analytics, user profiles, shopping, and Stripe configuration.",
  "frontend/src/hooks/useSessionStorageState.ts": "Custom React hook that provides useState-like interface for persisting state in sessionStorage with JSON serialization and error handling.",
  "frontend/src/hooks/useVerticalScrollSnap.ts": "Custom React hook that implements vertical scroll snap behavior with debounced scroll end detection and optional callback for the current scroll index.",
  "frontend/src/index.css": "Global CSS with Tailwind directives, OKLCH color system for light/dark themes with deep red/black branding, custom scrollbar styling, and animation utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with tabbed interface for managing movies, podcasts, videos, clips, series, channels, live schedules, brands, ads, analytics, and Stripe setup, protected by admin role check.",
  "frontend/src/pages/BrandDetailPage.tsx": "Brand detail page displaying brand information with logo/icon and organized content sections for films, series, and clips associated with the brand.",
  "frontend/src/pages/ClipsPage.tsx": "Page displaying a grid of video clips in vertical (9:16) aspect ratio with hover overlays showing play button and title, navigating to watch page on click.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Displays a video player for TV series episodes with ad support, premium content gating, and navigation back to the series page. Handles authentication checks, premium user detection, and conditionally shows ads based on user status and episode assignments.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring an auto-cycling slideshow of videos, series, and sponsored ads with video/image previews, plus sections for clips/shorts feed, featured brands, and content grids. Implements video autoplay for featured content and navigation to various content types.",
  "frontend/src/pages/LivePage.tsx": "Live TV page with two modes: 'watch' for streaming selected channels and 'guide' for viewing the TV schedule grid. Manages channel selection with session storage, premium user detection, and displays synchronized live TV player with channel list.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page with tabbed interface for email login/registration and Internet Identity admin login. Handles form validation, password confirmation, and redirects authenticated users to home page with toast notifications for feedback.",
  "frontend/src/pages/MoviesPage.tsx": "Displays a grid of movie content filtered from all videos by content type (movie/film) and VOD availability. Simple layout with Film icon header and loading state.",
  "frontend/src/pages/NetworksPage.tsx": "Displays a grid of brand/network cards with logos, descriptions, and channel counts. Each card is clickable and navigates to the brand's detail page.",
  "frontend/src/pages/OriginalsPage.tsx": "Displays FAITH X-Stream original content organized by tabs (all, films, series, documentaries, educational) with filtering by content type and original status. Uses VideoCard and SeriesCard components to render filtered videos and series in responsive grids.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment failure message with an error icon and provides navigation buttons to return home or retry payment via the admin page.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe payment session on mount, invalidates user profile cache to refresh premium status, and displays success message with navigation to home or profile. Shows loading spinner during verification.",
  "frontend/src/pages/ProfilePage.tsx": "Displays authenticated user profile with premium/admin badges, watch history with playback resume, and subscription management. Redirects unauthenticated users to home and shows skeleton loaders during data fetching.",
  "frontend/src/pages/SearchResultsPage.tsx": "Performs search via actor backend and displays categorized results (films, series, clips, brands) in responsive grids. Shows loading, empty query, and no results states.",
  "frontend/src/pages/SeriesDetailPage.tsx": "Displays series details with hero image, description, and accordion of seasons/episodes. Provides navigation to episode watch page and back to TV shows listing.",
  "frontend/src/pages/TVShowsPage.tsx": "Lists all available TV series in a responsive grid using SeriesCard components with loading and empty states.",
  "frontend/src/pages/UpgradePage.tsx": "Premium subscription upgrade page that displays free vs premium plan comparison, handles Stripe checkout session creation for $9.99/month subscription, and redirects admin users who have automatic premium access.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Video player page component that fetches video content by ID, determines ad display based on user premium status, and renders the VideoPlayer component with appropriate ads or shows premium-locked content message.",
  "frontend/src/types/index.ts": "Empty TypeScript types index file with no content.",
  "frontend/src/utils/contentType.ts": "Utility functions for working with ContentType enum, providing label conversion, type checking predicates, and helper functions to filter movie/film and podcast content types.",
  "frontend/src/utils/epg.ts": "Electronic Program Guide (EPG) utilities that generate time slots, calculate program blocks with positioning for live TV channels, handle schedule looping, and determine current playing programs with time offsets.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities that work with both hash-based and query string routing, providing functions to extract, persist to sessionStorage, and clear URL parameters including sensitive data removal.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended theme including sidebar colors, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file for a video streaming platform with admin dashboard, documenting architectural decisions for FAST/Live TV channels, VOD content management, ad insertion, auto-clip generation, and dual availability toggles. Lists known issues including autoplay freezing, UI bugs, video update failures, Live TV playback restarting, and broken authentication."
}