{
  "backend/main.mo": "Defines the main canister actor with extensive content, media, channel, ads, analytics, and metadata types for the platform.",
  "backend/migration.mo": "Migration module converting old video content records to a new format by adding the eligibleForLive flag.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the role and behavior of various frontend components and pages.",
  "frontend/index.html": "Base HTML file bootstrapping the React app with root container and main script import.",
  "frontend/src/App.tsx": "Sets up the full application router with routes for all major pages, wrapped in authentication and layout providers.",
  "frontend/src/components/admin/AnalyticsDashboard.tsx": "Displays analytics stats and trending content, showing loading skeletons and a grid of metric cards using data from useGetAnalytics.",
  "frontend/src/components/admin/BrandManagement.tsx": "Provides UI for creating, updating, deleting brands and assigning various content types, including file upload and form handling.",
  "frontend/src/components/admin/ChannelManagement.tsx": "Manages live channel creation, editing, and deletion with logo uploads and dialog-based editing.",
  "frontend/src/components/admin/ClipsManagement.tsx": "Handles uploading, editing, and deleting video clips with file uploads, metadata fields, and progress tracking.",
  "frontend/src/components/admin/LiveScheduleManagement.tsx": "Allows scheduling programs and managing ad breaks for live channels, with validation and updates via useUpdateLiveChannel.",
  "frontend/src/components/admin/ManualAdsManagement.tsx": "Provides UI and logic to upload, assign, and delete ad media and ad assignments using query hooks. Handles file uploads, form state, and CRUD operations for ads.",
  "frontend/src/components/admin/MoviesManagement.tsx": "Manages uploading, updating, and deleting movie video content, including metadata, thumbnails, trailers, and upload progress. Filters movie-type videos and provides edit dialogs.",
  "frontend/src/components/admin/PodcastsManagement.tsx": "Supports uploading and editing podcast video entries with thumbnails, premium/original flags, and file uploads. Includes editing dialog and update logic.",
  "frontend/src/components/admin/SeriesManagement.tsx": "Handles creation and management of TV series, seasons, and episodes with file uploads and metadata. Provides forms for nested CRUD across series hierarchy.",
  "frontend/src/components/admin/StripeSetup.tsx": "Displays Stripe configuration status and provides a form to set or update secret keys and allowed countries. Uses query hooks to check and update Stripe setup.",
  "frontend/src/components/admin/VideoManagement.tsx": "Admin interface for uploading, editing, and deleting videos with file handling and metadata fields.",
  "frontend/src/components/ContextualModal.tsx": "Reusable modal component displaying contextual messages with icons, descriptions, and optional action buttons.",
  "frontend/src/components/Footer.tsx": "Renders the footer with branded links and opens contextual modals for privacy, terms, and contact info.",
  "frontend/src/components/Header.tsx": "Provides the main navigation, search bar, and user menu with authentication-aware actions and responsive layout.",
  "frontend/src/components/HeroSection.tsx": "Displays a featured video with autoplay preview and buttons to play or view more details.",
  "frontend/src/components/Layout.tsx": "Wraps the app layout with header, footer, routed content, and the profile setup modal.",
  "frontend/src/components/live/LiveGuideGrid.tsx": "Renders a scrollable live TV program guide with time slots, channels, and current‑time positioning.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a modal for Internet Identity users to complete their profile by submitting an email.",
  "frontend/src/components/SeriesCard.tsx": "Displays a TV series card with thumbnail, metadata, and navigation to the series page.",
  "frontend/src/components/VideoCard.tsx": "Renders a video card with thumbnail, content type badges, and navigation to the watch page.",
  "frontend/src/components/VideoPlayer.tsx": "Implements a custom video player with autoplay, ads, preview mode, quality control, and live TV features.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAuth.tsx": "Provides authentication state and logic for email/password and Internet Identity, including session restore and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login, stored identities, and AuthClient lifecycle with status tracking.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating videos, profiles, admin data, and other backend resources using the actor.",
  "frontend/src/hooks/useSessionStorageState.ts": "Custom hook that syncs React state with sessionStorage.",
  "frontend/src/index.css": "Defines Tailwind layers, light/dark OKLCH theme variables, animations, and custom deep‑red/black scrollbar and background styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Renders the admin panel with permission checking and tabbed management sections for videos, clips, channels, ads, brands, and analytics.",
  "frontend/src/pages/BrandDetailPage.tsx": "Loads a brand and its associated films, series, and clips, showing a branded header and content grid with loading states.",
  "frontend/src/pages/ClipsPage.tsx": "Displays a grid of all clips with skeleton loading and hover preview effects, linking to the watch page.",
  "frontend/src/pages/EpisodePlayerPage.tsx": "Fetches a specific episode and plays it with optional ads based on user status, with navigation back to the series.",
  "frontend/src/pages/HomePage.tsx": "Builds a homepage with featured videos, series, and ads in a rotating slideshow plus listings for main content types.",
  "frontend/src/pages/LivePage.tsx": "Displays live channels with auto-selection, program polling, ad handling, and watch/guide modes using several data-fetching hooks.",
  "frontend/src/pages/LoginPage.tsx": "Provides email and Internet Identity login and registration forms with validation and redirects after authentication.",
  "frontend/src/pages/MoviesPage.tsx": "Fetches all videos, filters movies, and displays them in a grid with loading skeletons.",
  "frontend/src/pages/NetworksPage.tsx": "Lists all brands with logos and descriptions and allows navigation to individual brand pages.",
  "frontend/src/pages/OriginalsPage.tsx": "Shows original films, series, documentaries, and educational content with tabbed filtering.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure message with navigation options to retry or return home.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe session status, updates user profile, and shows a success screen with navigation options.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page fetching user data, admin status, watch history, and rendering profile info with watched content. Handles redirects and loading states.",
  "frontend/src/pages/SearchResultsPage.tsx": "Search results page that triggers a search query, filters results by type, and displays categorized media lists with loading and empty states.",
  "frontend/src/pages/SeriesDetailPage.tsx": "Series detail page that fetches a series by ID, shows metadata, hero banner, and season/episode structure with loading and not‑found handling.",
  "frontend/src/pages/TVShowsPage.tsx": "Displays all TV series using SeriesCard components with loading skeletons and a fallback message when none exist.",
  "frontend/src/pages/UpgradePage.tsx": "Premium upgrade page showing features and handling Stripe checkout; auto‑redirects admins and manages payment initiation state.",
  "frontend/src/pages/VideoPlayerPage.tsx": "Video player page that loads a video, checks premium access, assigns ads, and renders a player with metadata and access restrictions.",
  "frontend/src/types/index.ts": "Empty types index placeholder.",
  "frontend/src/utils/contentType.ts": "Utility functions for mapping content types to labels and determining category groupings like movies and podcasts.",
  "frontend/src/utils/epg.ts": "Generates EPG time slots and computes program blocks for channels based on looping schedules and video metadata.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins like typography and container queries.",
  "project_state.json": "Describes the project's state, issues, architecture notes, and existing features for a streaming platform with live and VOD content."
}