{
  "kind": "build_request",
  "title": "Fix Live TV VOD-scheduled channels restarting after a few seconds",
  "projectName": "Live TV Scheduler Fix",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-10",
      "text": "Fix LivePage scheduled VOD playback so it does not restart the currently airing program from the beginning every few seconds on all channels.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6",
          "msg-10",
          "msg-12"
        ],
        "quotes": [
          "The live video isn't playing according to the programming set as scheduled? it keeps playing a few seconds of the video and restarting",
          "restart-after-a-few-seconds issue happen on all scheduled VOD channels",
          "restart full video from the beginning, not from where it left off at."
        ]
      },
      "acceptanceCriteria": [
        "When watching any VOD-scheduled live channel, the video continues playing past the first few seconds and does not restart from 0 unless the schedule program actually changes.",
        "The LivePage polling/update loop does not cause the VideoPlayer component to remount (or otherwise reset src/currentTime) while the same scheduled program is still current.",
        "Switching channels still starts playback of the newly selected channel’s current program."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Align LivePage playback position with the channel schedule by seeking into the current program based on the computed position-in-loop, so playback reflects where the program should be at the current time (instead of always starting at 0).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "its VOD and it plays based on the video its supposed to create the program based on the length of the video."
        ]
      },
      "acceptanceCriteria": [
        "On entering LivePage (or switching channels), playback starts at the correct offset within the scheduled VOD program for the current time.",
        "When the schedule rolls over to the next program, playback switches to the next program and starts at the correct offset (typically near 0 at program start).",
        "The schedule-aligned seeking does not break non-live usage of VideoPlayer (VOD pages continue to start at 0 unless otherwise intended)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend must remain single-actor; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not redesign the Live Guide (EPG grid) UI or add new guide features beyond fixing the playback restart/position behavior.",
    "Do not change ad business logic beyond what is necessary to prevent live scheduled playback from restarting."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}