{
  "kind": "build_request",
  "title": "Live TV: disable forward seeking, scheduled unskippable ad breaks, and Live-eligible upload flag",
  "projectName": "Caffeine Live TV",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Prevent users from seeking forward during Live TV playback only (regular and guest users), while keeping normal seeking behavior for non-Live (VOD) playback.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1. Live TV Channels",
          "Every program should be live, no seeking forward"
        ]
      },
      "acceptanceCriteria": [
        "When VideoPlayer is rendered with isLiveTV=true, the scrubber/seek UI cannot be used to jump forward beyond the current live position for the program.",
        "When isLiveTV=true, the 10-second forward skip control is not available and keyboard/mouse interactions cannot advance playback beyond the computed live position.",
        "When isLiveTV=false, seeking and skip controls continue to work as they do today."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Implement Live TV ad breaks that auto-insert at scheduled timestamps during the currently airing program, and make those ads unskippable (no seeking/scrubbing/skip-forward) for regular and guest users.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes, ads should auto-insert at scheduled timestamps but the user should not be able to skip them."
        ]
      },
      "acceptanceCriteria": [
        "For Live TV playback (isLiveTV=true) and non-premium viewers, when the current program reaches each scheduled ad timestamp, the player automatically switches to ad playback.",
        "While an ad is playing, the user cannot seek/scrub or skip forward; attempts to change playback position do not bypass the ad.",
        "After the ad finishes, playback returns to the correct Live TV program position (resume the main content at the correct timestamp, not at 0).",
        "Premium users do not see these scheduled Live TV ads (consistent with existing free-only ad behavior)."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Add an admin-selectable flag on uploaded/edited videos to mark whether the content is eligible to be scheduled into Live TV channels versus being standalone VOD-only, and enforce that eligibility in Live scheduling UI.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "We should also be able to select what content we have when I upload whether it can be shown live or just on the platform as a standalone content",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "Backend VideoContent includes a persisted field representing Live TV eligibility (e.g., Live-eligible vs VOD-only), and add/update operations preserve it.",
        "Admin video upload/edit UIs expose a clear toggle/select to set this Live TV eligibility value using English user-facing text.",
        "LiveScheduleManagement only offers Live-eligible videos in the “Choose a video” selector for scheduling (or clearly labels and blocks ineligible items from being scheduled).",
        "Existing videos without an explicit eligibility value remain valid after upgrade (migration applied only if needed) and default behavior is consistent and documented in code."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Allow admins to configure scheduled ad break timestamps for Live TV programs in the Live schedule so that scheduled timestamps can be managed without code changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Yes, ads should auto-insert at scheduled timestamps"
        ]
      },
      "acceptanceCriteria": [
        "LiveScheduleManagement provides a way to add/remove one or more ad break entries for a scheduled program, including a timestamp/position value and associated ad media selection.",
        "The configured ad breaks are saved into the existing LiveChannel.schedule entries (ScheduledContent.adLocations) and are used by LivePage/VideoPlayer to trigger scheduled ad playback.",
        "All new admin UI text is in English."
      ]
    }
  ],
  "constraints": [
    "Respect single-actor backend architecture: all Motoko logic must remain in backend/main.mo; only add backend/migration.mo changes if persisted state requires migration.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Use the existing React + TypeScript + Tailwind + React Query stack; no external databases or third-party auth beyond existing patterns."
  ],
  "nonGoals": [
    "Do not change seeking behavior for on-demand (non-Live) movies, series episodes, clips, or podcasts.",
    "Do not introduce real-time/WebSocket-based live streaming; continue using the existing scheduled VOD-to-live approach.",
    "Do not add new third-party ad SDKs or external ad servers; use existing ad media storage and scheduling structures."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}