{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "FAITH X-Stream — Fix broken login (email/password + Internet Identity)",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Restore reliable email/password register + login from /login, independent of Internet Identity, with clear user-facing errors and post-auth redirect.",
      "acceptanceCriteria": [
        "A new user can successfully register via the Sign Up tab on /login and is redirected to / after success.",
        "An existing user can successfully log in via the Login tab on /login and is redirected to / after success.",
        "Registration and login do not fail due to backend access control initialization or authorization traps.",
        "Login failures show a clear, user-readable error message (not a generic failure) on the Login page toast."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Harden email/password auth actions: normalize backend error messages into user-readable errors (e.g., invalid credentials, email already registered), ensure email/password auth does not depend on Internet Identity state, and ensure stored emailAuth restoration is safe and clears invalid sessions without loops. (Selected component: authorization — align frontend expectations with role-based access control behavior; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Ensure email/password Sign Up and Login flows use the fixed auth actions, display specific error toasts from normalized errors, and redirect to / only after auth transitions to authenticated success (not during render). (Selected component: authorization — handle authorization trap errors gracefully in UI; verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Fix frontend auth state machine so actor initialization and session restoration never block login and never leave UI stuck initializing/authenticating.",
      "acceptanceCriteria": [
        "The Login button is not stuck on \"Loading...\" indefinitely on first app load.",
        "Clicking Login (email/password) while the actor is still initializing either waits safely or shows a clear message, and then proceeds when ready.",
        "If a stored emailAuth session exists, the app restores it reliably and sets authenticated UI state (Header shows profile menu, not Login button).",
        "If session restoration fails, the stored session is cleared and the app returns to an idle unauthenticated state without loops."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Decouple 'initializing' from permanent actor availability by ensuring authStatus transitions to idle when initialization completes even if no session exists; implement a safe 'wait for actor readiness' strategy for email login/register (bounded wait + clear message), and map Internet Identity login status changes into authStatus so authenticating does not persist indefinitely. (Selected component: authorization — follow the guidance for handling unauthorized traps and clearing cached user data on logout; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Adjust loading/disabled behavior of the Login button so it is not blocked by an 'initializing' authStatus forever; only show loading when a real auth action is in-flight, and keep navigation to /login available when unauthenticated. (Selected component: authorization — ensure cached profile/admin UI is cleared/hidden when unauthenticated; verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Fix /login redirect behavior to avoid navigation during render, loops, or blank screens when auth state changes.",
      "acceptanceCriteria": [
        "When already authenticated, visiting /login redirects to / without console errors/warnings about state updates or navigation during render.",
        "When unauthenticated, /login remains accessible and does not unexpectedly redirect away.",
        "After logout, the user can navigate to /login and log in again successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Replace render-time redirect with an effect-based redirect that triggers only when auth becomes authenticated; ensure the page remains stable for unauthenticated users and after logout, preventing redirect loops. (Selected component: authorization — ensure auth-based gating is effect-driven and trap errors are surfaced as readable UI messages; verify the component's usage instructions before implementing.)"
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Keep Internet Identity admin login working end-to-end from the Login page, including actor readiness and admin checks/UI after II auth, and clean logout.",
      "acceptanceCriteria": [
        "Clicking \"Login with Internet Identity\" completes II login successfully when configured, and authenticated state becomes true.",
        "After II login, admin-only checks (e.g., isCallerAdmin) work and admin navigation items can appear when appropriate.",
        "Logging out clears the II session and returns the app to unauthenticated state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Ensure Internet Identity login updates authStatus deterministically based on Internet Identity hook status and identity presence; on success, set authMethod to internet-identity and clear any stored emailAuth session; on failure, return to idle with a surfaced error. (Selected component: authorization — ensure post-II login state supports admin checks and cached data clearing on logout; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Wire the Internet Identity login button to show correct in-progress state and surface failures via toast; rely on effect-based redirect to / after successful II auth. (Selected component: authorization — support admin login UX and trap-to-message error handling; verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Confirm admin navigation visibility is tied to admin check results after II login and that logout clears React Query cache and returns UI to unauthenticated state cleanly. (Selected component: authorization — follow Access Control UI guidance for admin-only visibility; verify the component's usage instructions before implementing.)"
        }
      ]
    }
  ]
}