{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Live TV seek locking, scheduled unskippable ad breaks, and Live-eligible video flag (frontend)",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Disable forward seeking and forward-skip controls for Live TV playback while preserving current VOD seeking behavior.",
      "acceptanceCriteria": [
        "When VideoPlayer is rendered with isLiveTV=true, the scrubber/seek UI cannot be used to jump forward beyond the current live position for the program.",
        "When isLiveTV=true, the 10-second forward skip control is not available and keyboard/mouse interactions cannot advance playback beyond the computed live position.",
        "When isLiveTV=false, seeking and skip controls continue to work as they do today."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoPlayer.tsx",
          "operation": "modify",
          "description": "Add Live TV forward-seek prevention: compute a moving live-edge (based on initial liveSeekSeconds and elapsed wall time), clamp any seek attempts to <= live-edge, hide/disable the +10s skip control for isLiveTV, and prevent keyboard/mouse interactions from moving playback beyond live-edge. Ensure behavior remains unchanged for non-Live (isLiveTV=false) playback."
        }
      ]
    },
    {
      "id": "REQ-18",
      "summary": "Trigger scheduled Live TV ad breaks at configured timestamps and make ad playback unskippable for non-premium viewers, resuming main content at the correct live position after ads.",
      "acceptanceCriteria": [
        "For Live TV playback (isLiveTV=true) and non-premium viewers, when the current program reaches each scheduled ad timestamp, the player automatically switches to ad playback.",
        "While an ad is playing, the user cannot seek/scrub or skip forward; attempts to change playback position do not bypass the ad.",
        "After the ad finishes, playback returns to the correct Live TV program position (resume the main content at the correct timestamp, not at 0).",
        "Premium users do not see these scheduled Live TV ads (consistent with existing free-only ad behavior)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoPlayer.tsx",
          "operation": "modify",
          "description": "Extend Live TV playback to support scheduled ad breaks from the current program schedule entry (ScheduledContent.adLocations): when main content time reaches each ad location position, switch to ad playback using the configured ad media URLs; enforce unskippable behavior during ads (no scrubbing/skip controls); after ad ends, resume main content at the correct live-aligned timestamp (not 0) and continue respecting the moving live-edge."
        },
        {
          "path": "frontend/src/pages/LivePage.tsx",
          "operation": "modify",
          "description": "Wire scheduled ad locations for the currently airing program into VideoPlayer when isLiveTV=true and the viewer is non-premium; ensure Premium users do not receive scheduled Live TV ad break configuration from the page."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Expose and enforce a Live TV eligibility flag for uploaded/edited videos in admin UIs and limit Live scheduling choices to eligible videos.",
      "acceptanceCriteria": [
        "Backend VideoContent includes a persisted field representing Live TV eligibility (e.g., Live-eligible vs VOD-only), and add/update operations preserve it.",
        "Admin video upload/edit UIs expose a clear toggle/select to set this Live TV eligibility value using English user-facing text.",
        "LiveScheduleManagement only offers Live-eligible videos in the “Choose a video” selector for scheduling (or clearly labels and blocks ineligible items from being scheduled).",
        "Existing videos without an explicit eligibility value remain valid after upgrade (migration applied only if needed) and default behavior is consistent and documented in code."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/VideoManagement.tsx",
          "operation": "modify",
          "description": "Add an English-labeled admin control (e.g., switch) for VideoContent.eligibleForLive on upload and edit flows; include eligibleForLive in the VideoContent object passed to add/update mutations and initialize edit dialog state from the existing value."
        },
        {
          "path": "frontend/src/components/admin/MoviesManagement.tsx",
          "operation": "modify",
          "description": "Add an English-labeled admin control for eligibleForLive in the movie upload/edit UI and ensure the value is included in add/update operations for movie-type VideoContent."
        },
        {
          "path": "frontend/src/components/admin/ClipsManagement.tsx",
          "operation": "modify",
          "description": "Add an English-labeled admin control for eligibleForLive in the clip upload/edit UI and ensure the value is included in add/update operations for clip-type VideoContent."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook that fetches Live-eligible videos using the existing backend capability getEligibleVideosForLive(), and cache/invalidate consistently with other video queries."
        },
        {
          "path": "frontend/src/components/admin/LiveScheduleManagement.tsx",
          "operation": "modify",
          "description": "Enforce Live eligibility in the scheduling UI by sourcing the “Choose a video” list from the new getEligibleVideosForLive hook (or by filtering all videos by eligibleForLive), preventing scheduling of VOD-only items."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add admin UI to configure scheduled ad break timestamps and associated ad media for each scheduled Live TV program, persisted into ScheduledContent.adLocations and used by playback.",
      "acceptanceCriteria": [
        "LiveScheduleManagement provides a way to add/remove one or more ad break entries for a scheduled program, including a timestamp/position value and associated ad media selection.",
        "The configured ad breaks are saved into the existing LiveChannel.schedule entries (ScheduledContent.adLocations) and are used by LivePage/VideoPlayer to trigger scheduled ad playback.",
        "All new admin UI text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/LiveScheduleManagement.tsx",
          "operation": "modify",
          "description": "Extend each scheduled program row with an ad-break editor: allow admins to add/remove adLocations entries with a position (timestamp/seconds into program) and an associated ad media selection sourced from existing ad media; persist changes by updating the selected channel schedule via the existing updateLiveChannel mutation. Ensure all new UI text is English."
        },
        {
          "path": "frontend/src/pages/LivePage.tsx",
          "operation": "modify",
          "description": "Ensure the currently airing program’s configured ScheduledContent.adLocations are surfaced to VideoPlayer for Live ad triggering (and remain consistent with saved schedule updates)."
        }
      ]
    }
  ]
}