{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore Internet Identity Login Button and Authentication Flow",
  "requirements": [
    {
      "id": "REQ-88",
      "summary": "Add Internet Identity login button back to LoginPage UI alongside existing email/password form",
      "acceptanceCriteria": [
        "LoginPage displays an Internet Identity login button in addition to the existing email/password form",
        "The II button is visually distinct and clearly labeled (e.g., 'Login with Internet Identity')",
        "Both authentication options are presented in a clear, user-friendly layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Add Internet Identity login button to the LoginPage UI. Place the button prominently above or below the existing tabbed login/registration forms with clear labeling like 'Login with Internet Identity'. Use styling consistent with the existing authentication UI (e.g., shadcn button components). Ensure the button is accessible and visually separated from the email/password authentication section to prevent confusion between the two authentication methods."
        }
      ]
    },
    {
      "id": "REQ-89",
      "summary": "Wire Internet Identity button to trigger useInternetIdentity authentication flow",
      "acceptanceCriteria": [
        "Clicking the II button invokes the login method from useInternetIdentity hook",
        "The Internet Identity authentication window opens correctly",
        "The button shows appropriate loading/disabled state during authentication"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Import useInternetIdentity hook and wire the Internet Identity button's onClick handler to invoke the login() method. Extract loginStatus from the hook to show appropriate button states: display 'Logging in...' text and disable the button when loginStatus is 'logging-in', show 'Login with Internet Identity' when idle. Handle the async login call with proper error catching. Ensure the button triggers the Internet Identity authentication window to open when clicked."
        }
      ]
    },
    {
      "id": "REQ-90",
      "summary": "Ensure successful Internet Identity login updates authentication state synchronously across all components",
      "acceptanceCriteria": [
        "After successful II authentication, useAuth context updates isAuthenticated flag immediately",
        "User state is populated with identity information from Internet Identity",
        "All components consuming useAuth hook receive updated authentication state"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Review the AuthProvider implementation to ensure it properly subscribes to Internet Identity state changes from useInternetIdentity. When the II identity becomes available, immediately update the isAuthenticated flag and populate user state. Ensure the context value is updated synchronously so all consuming components (Header, ProfileSetupModal, etc.) receive the new authentication state without delay. Verify that the identity from useInternetIdentity is correctly reflected in the auth context."
        }
      ]
    },
    {
      "id": "REQ-91",
      "summary": "Trigger actor initialization immediately after successful Internet Identity login",
      "acceptanceCriteria": [
        "Actor initialization begins immediately after II login succeeds",
        "Actor is fully created and ready before profile queries are enabled",
        "No undefined actor errors occur during post-login UI rendering"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Ensure the useActor hook reacts immediately to Internet Identity authentication completion. When the identity becomes available after successful II login, trigger actor creation synchronously before any components attempt to use the actor. Verify that the actor is fully initialized and ready before enabling dependent queries. Add proper dependency tracking on the identity state to ensure the actor is recreated when the identity changes from null to an authenticated identity."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "After successful Internet Identity login completes, ensure that any actor-dependent operations wait for the actor to be fully initialized. Check the actor state from useActor hook and defer navigation or profile queries until the actor is available. This prevents undefined actor errors during the post-login transition."
        }
      ]
    },
    {
      "id": "REQ-92",
      "summary": "Invalidate and refetch user profile queries after successful Internet Identity login",
      "acceptanceCriteria": [
        "User profile query is invalidated and refetched after II login completes",
        "Profile data including role information (admin/premium) is available",
        "Header component re-renders showing authenticated UI (profile dropdown, admin link) instead of login button"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Import useQueryClient from @tanstack/react-query and use it to invalidate the 'currentUserProfile' query immediately after successful Internet Identity login. Call queryClient.invalidateQueries({ queryKey: ['currentUserProfile'] }) to trigger an immediate refetch of the user profile data. This ensures that the Header component receives updated user information including admin/premium roles and can re-render to show the profile dropdown and admin link. Wait for the profile query to complete before proceeding with navigation to ensure UI consistency."
        }
      ]
    },
    {
      "id": "REQ-93",
      "summary": "Implement proper navigation after successful Internet Identity login without triggering navigation during render",
      "acceptanceCriteria": [
        "After successful II login, user is redirected to home page",
        "Navigation occurs after authentication state updates complete",
        "No navigation-during-render warnings or redirect loops occur",
        "User can immediately interact with authenticated features after redirect"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Implement post-login navigation using TanStack Router's useNavigate hook. After successful Internet Identity login, actor initialization, and profile query invalidation all complete, call navigate({ to: '/' }) to redirect to the home page. Ensure navigation happens in an async event handler (the login button's onClick), not during render, to avoid React warnings. Add a small delay if needed to ensure all authentication state updates have propagated before navigation. Verify that the redirect does not create loops by checking the current authentication state before attempting login."
        }
      ]
    }
  ]
}