{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Header UI state after Internet Identity login",
  "requirements": [
    {
      "id": "REQ-53",
      "summary": "Update Header component to immediately re-render and reflect authenticated state when Internet Identity login completes",
      "acceptanceCriteria": [
        "After successful Internet Identity login, Header shows profile dropdown instead of 'Login' button",
        "Admin link appears in Header for admin users after Internet Identity login",
        "Header updates without requiring page reload or manual navigation",
        "Profile and admin panel become accessible immediately after login completes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Refactor Header to properly track and respond to Internet Identity authentication state changes. Replace the current authentication state logic to directly consume identity from useInternetIdentity hook instead of relying on useAuth, ensuring immediate re-renders when identity changes. Update the conditional rendering logic to synchronously display profile dropdown and admin link based on the current identity and user role. Remove any stale state dependencies that delay UI updates after login completes."
        }
      ]
    },
    {
      "id": "REQ-54",
      "summary": "Fix useInternetIdentity hook and useAuth context to synchronously propagate authentication state changes to all consuming components",
      "acceptanceCriteria": [
        "Authentication state updates propagate synchronously after Internet Identity login",
        "All components consuming auth context (Header, protected routes) receive updated state immediately",
        "isAuthenticated flag reflects true state without delay after successful login",
        "No race conditions between auth state update and component re-renders"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Refactor AuthProvider to ensure authentication state updates are synchronous and immediately propagate to all consuming components. Review the state update logic in login and authentication restoration flows to eliminate any asynchronous delays or race conditions. Ensure that isAuthenticated flag is set immediately when identity is available from Internet Identity, triggering immediate re-renders in all consuming components including Header. Add explicit dependency tracking to ensure context consumers re-render synchronously when authentication state changes."
        }
      ]
    },
    {
      "id": "REQ-55",
      "summary": "Invalidate and refetch user profile queries immediately after Internet Identity login completes to ensure profile data and role information are available",
      "acceptanceCriteria": [
        "Profile query invalidation triggers immediately after Internet Identity authentication succeeds",
        "User role data (admin status) is fetched and available before Header attempts to render role-specific UI",
        "Query refetch completes before navigation or protected component rendering",
        "No undefined or stale profile data causes incorrect UI states in Header"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Add query invalidation and refetch logic immediately after successful Internet Identity login. Use useQueryClient to invalidate the 'callerLoginStatus' query key and await the refetch before updating authentication state. Ensure the profile data (including admin role) is fetched and available synchronously before setting isAuthenticated to true, preventing Header from rendering with incomplete user data. Coordinate with useActor to ensure actor is initialized before profile queries execute."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useGetCallerLoginStatus hook to properly handle actor availability and loading states. Ensure the query is enabled only when actor is fully initialized and not fetching. Add explicit isLoading state that accounts for both actor fetching and query loading states to prevent premature rendering in Header. Return custom loading state that accurately reflects whether role data is ready for consumption by UI components."
        }
      ]
    },
    {
      "id": "REQ-56",
      "summary": "Ensure actor initialization completes successfully after Internet Identity login before Header and other authenticated components attempt to render",
      "acceptanceCriteria": [
        "Actor instance is fully initialized with Internet Identity principal before profile queries execute",
        "Header waits for actor availability before attempting to fetch user profile data",
        "No 'actor is undefined' errors occur during post-login UI rendering",
        "Protected routes and admin checks have valid actor instance available"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add actor availability checks to Header rendering logic. Consume actorFetching state from useActor hook and display loading state in Header while actor is initializing after Internet Identity login. Prevent profile dropdown and admin link rendering until both actor is available and user role data has been successfully fetched. Show a loading indicator or skeleton UI in the authentication controls area during actor initialization to avoid flashing incorrect UI states."
        },
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Coordinate authentication state updates with actor initialization lifecycle. After Internet Identity login succeeds, wait for actor to be fully initialized before invalidating profile queries and updating isAuthenticated state. Add explicit checks to ensure actor instance exists and is not in fetching state before attempting to fetch user profile or role data. This prevents race conditions where Header tries to render authenticated UI before actor is ready to serve profile queries."
        }
      ]
    }
  ]
}