{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix authentication state propagation and revert unintended UI changes",
  "requirements": [
    {
      "id": "REQ-71",
      "summary": "Fix authentication state propagation in useAuth context to ensure isAuthenticated flag and user state update immediately and synchronously after successful login",
      "acceptanceCriteria": [
        "After successful login via Internet Identity, Header immediately shows profile dropdown and admin link instead of 'Login' button",
        "After successful login via email/password, Header immediately shows profile dropdown and admin link instead of 'Login' button",
        "Authentication state change triggers synchronous re-render of all consuming components",
        "No delays or race conditions between login completion and UI update"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Ensure login and loginWithPassword methods immediately update isAuthenticated state before resolving, triggering synchronous context updates. Remove any async delays or race conditions between identity/actor initialization and state updates. Ensure context value includes fresh isAuthenticated state that consuming components can read immediately after login completes."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Verify Header correctly subscribes to useAuth context and re-renders immediately when isAuthenticated changes. Ensure conditional rendering logic for profile dropdown and admin link triggers synchronously on authentication state change without delays."
        }
      ]
    },
    {
      "id": "REQ-72",
      "summary": "Ensure actor initialization completes successfully and is fully available before authenticated UI components attempt to render or execute queries",
      "acceptanceCriteria": [
        "Actor is fully initialized before Header renders authenticated UI",
        "Actor is fully initialized before profile queries execute",
        "Actor is fully initialized before admin panel access checks run",
        "No undefined actor errors occur during authentication flow"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Ensure login methods wait for actor initialization to complete before resolving. Add synchronization between identity authentication and actor availability so that isAuthenticated only becomes true when actor is ready. Prevent race conditions where UI attempts to use actor before it's initialized."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add safety checks to prevent rendering authenticated UI elements (profile dropdown, admin link) until both isAuthenticated is true and actor is available. Use loading states if necessary to prevent undefined actor errors during the transition."
        }
      ]
    },
    {
      "id": "REQ-73",
      "summary": "Invalidate and refetch user profile queries immediately after successful login to ensure profile data including role information is fetched and available",
      "acceptanceCriteria": [
        "Profile queries are invalidated immediately after login completes",
        "Profile data including admin/premium status is fetched before Header renders",
        "Header receives fresh profile data including role information",
        "Admin link appears in Header when user has admin role",
        "Profile page is accessible immediately after login"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Add queryClient.invalidateQueries(['currentUserProfile']) and queryClient.invalidateQueries(['loginStatus']) calls immediately after successful login (both Internet Identity and email/password). Ensure these invalidations trigger before the login promise resolves so that consuming components receive fresh data when they re-render."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Ensure Header uses profile query hooks (useGetCallerLoginStatus or equivalent) to fetch role information and conditionally render admin link based on user role. Verify queries are enabled only when actor is available and isAuthenticated is true."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review useGetCallerLoginStatus and useGetCallerUserProfile hooks to ensure they properly handle actor availability, set enabled flags correctly, and return accurate loading states that prevent premature rendering in Header."
        }
      ]
    },
    {
      "id": "REQ-74",
      "summary": "Remove or refactor LiveTVSyncPlayer initialization logic that interferes with authentication flow, actor creation, or session management",
      "acceptanceCriteria": [
        "LiveTVSyncPlayer does not interfere with login flow",
        "LiveTVSyncPlayer does not block actor initialization",
        "LiveTVSyncPlayer does not reset authentication context",
        "No circular dependencies between LiveTVSyncPlayer and authentication",
        "Login completes successfully without being stuck in loading state"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LiveTVSyncPlayer.tsx",
          "operation": "modify",
          "description": "Review and refactor any initialization, mounting, or polling logic that may interfere with authentication flow. Ensure the component does not call actor methods before actor is initialized. Remove any side effects that could reset authentication context or create circular dependencies. Defer sync polling until both authentication and actor are confirmed ready."
        },
        {
          "path": "frontend/src/pages/LivePage.tsx",
          "operation": "modify",
          "description": "Ensure LiveTVSyncPlayer is only rendered after authentication completes and actor is available. Add conditional rendering or loading guards to prevent LiveTVSyncPlayer from mounting prematurely and blocking login flow."
        }
      ]
    },
    {
      "id": "REQ-75",
      "summary": "Fix LoginPage navigation and redirect logic to successfully navigate users to the home page after login without triggering navigation during render or causing redirect loops",
      "acceptanceCriteria": [
        "After successful login, user is redirected to home page",
        "Navigation occurs only in useEffect or event handlers, not during render",
        "No redirect loops occur after login",
        "UI does not get stuck in loading state after login",
        "Redirect completes successfully for both Internet Identity and email/password login"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Refactor navigation logic to ensure redirects occur only in useEffect hooks or event handlers after login completes. Use TanStack Router's navigate function correctly. Add proper guards to prevent redirect loops (check if already authenticated before showing login UI). Ensure UI loading states clear after successful navigation. Remove any navigation calls during render phase."
        }
      ]
    },
    {
      "id": "REQ-76",
      "summary": "Revert unintended visual changes to Header navigation component to restore expected appearance before recent updates",
      "acceptanceCriteria": [
        "Header navigation visual appearance matches state before recent authentication fixes",
        "Navigation links spacing is restored to original",
        "Navigation styling matches original design",
        "Layout structure is restored to original",
        "Responsive behavior works correctly on mobile and desktop",
        "Accessibility features remain intact"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Review and revert any unintended CSS class changes, inline style modifications, or structural changes to navigation links and layout that occurred during recent authentication fixes. Restore original spacing, styling, and layout structure while preserving functional authentication improvements. Verify responsive behavior and accessibility features remain intact."
        }
      ]
    },
    {
      "id": "REQ-77",
      "summary": "Review and revert any unintended UI changes across all pages and components that occurred during recent updates",
      "acceptanceCriteria": [
        "All pages maintain their original visual appearance",
        "Layout and styling changes from recent updates are reverted where unintended",
        "Functional improvements from recent updates are preserved",
        "No visual regressions exist compared to state before recent authentication fixes"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Review and revert any unintended visual changes to layout, styling, or component structure that occurred during recent updates. Restore original appearance while preserving functional improvements."
        },
        {
          "path": "frontend/src/pages/LivePage.tsx",
          "operation": "modify",
          "description": "Review and revert any unintended visual changes to layout, styling, or component structure. Ensure original appearance is restored while keeping functional fixes for authentication and sync player behavior."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Review and revert any unintended visual changes to admin panel layout, styling, or tab interface. Restore original appearance while preserving authentication access control improvements."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Review and revert any unintended visual changes to footer layout, styling, or link presentation. Ensure original appearance is restored."
        },
        {
          "path": "frontend/src/components/HeroSection.tsx",
          "operation": "modify",
          "description": "Review and revert any unintended visual changes to hero section layout, styling, or action buttons. Restore original appearance."
        },
        {
          "path": "frontend/src/components/VideoCard.tsx",
          "operation": "modify",
          "description": "Review and revert any unintended visual changes to video card styling, badge positioning, or hover effects. Ensure original appearance is restored."
        },
        {
          "path": "frontend/src/components/SeriesCard.tsx",
          "operation": "modify",
          "description": "Review and revert any unintended visual changes to series card styling, badge positioning, or layout. Restore original appearance."
        }
      ]
    },
    {
      "id": "REQ-78",
      "summary": "Add comprehensive error logging and debugging output throughout authentication flow to capture timing information, state transitions, and exact failure points",
      "acceptanceCriteria": [
        "Console logs show authentication state transitions",
        "Console logs show timing information for each authentication step",
        "Console logs identify exact failure points when login fails",
        "Console logs show actor initialization status",
        "Console logs show profile query execution status",
        "Error messages are clear and actionable for debugging"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAuth.tsx",
          "operation": "modify",
          "description": "Add console.log statements throughout authentication flow to track: (1) login method entry with timestamp, (2) identity acquisition status, (3) actor initialization status, (4) isAuthenticated state changes with timing, (5) query invalidation execution, (6) login completion with total elapsed time. Add detailed error logging with stack traces for all catch blocks. Use console.group/groupEnd for organized log sections."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add console.log statements to track: (1) authentication state from context, (2) actor availability status, (3) profile query status and data, (4) conditional rendering decisions for profile dropdown and admin link. Log re-renders with authentication state values."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add console.log statements in profile query hooks to track: (1) query enablement status, (2) actor availability, (3) query execution start/completion with timing, (4) data fetched or errors encountered. Use clear prefixes like '[ProfileQuery]' for easy filtering."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Add console.log statements to track: (1) form submission events, (2) login method calls with parameters (excluding sensitive data), (3) navigation decisions and timing, (4) loading state transitions. Log any errors during login or navigation with actionable context."
        },
        {
          "path": "frontend/src/components/LiveTVSyncPlayer.tsx",
          "operation": "modify",
          "description": "Add console.log statements to track: (1) component mount/unmount, (2) actor usage attempts, (3) sync polling cycles, (4) any interactions with authentication context. Use clear markers to identify when this component may be interfering with auth flow."
        }
      ]
    }
  ]
}