{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Live TV scheduled VOD playback restart + schedule-synced seeking fix",
  "requirements": [
    {
      "id": "REQ-10",
      "summary": "Prevent LivePage polling updates from resetting/remounting the live scheduled VOD player while the same program remains current.",
      "acceptanceCriteria": [
        "When watching any VOD-scheduled live channel, the video continues playing past the first few seconds and does not restart from 0 unless the schedule program actually changes.",
        "The LivePage polling/update loop does not cause the VideoPlayer component to remount (or otherwise reset src/currentTime) while the same scheduled program is still current.",
        "Switching channels still starts playback of the newly selected channel’s current program."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LivePage.tsx",
          "operation": "modify",
          "description": "Change the schedule polling/update loop to only update state (and only change the VideoPlayer key / identity) when the computed current scheduled content actually changes (e.g., contentId or program-instance start). Keep current program updates stable across polls to avoid resetting video src/currentTime. Ensure channel switching still forces a new program selection and starts playback for the selected channel."
        },
        {
          "path": "frontend/src/utils/epg.ts",
          "operation": "modify",
          "description": "Add/adjust a shared helper that, given a channel schedule and a timestamp, determines the current scheduled item and its position within the looping schedule (including the computed offset into the current item). Use this helper from LivePage so polling comparisons are consistent and do not trigger unnecessary re-renders."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Seek into the currently airing scheduled VOD program based on schedule-derived offset, without affecting non-live VOD playback behavior.",
      "acceptanceCriteria": [
        "On entering LivePage (or switching channels), playback starts at the correct offset within the scheduled VOD program for the current time.",
        "When the schedule rolls over to the next program, playback switches to the next program and starts at the correct offset (typically near 0 at program start).",
        "The schedule-aligned seeking does not break non-live usage of VideoPlayer (VOD pages continue to start at 0 unless otherwise intended)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoPlayer.tsx",
          "operation": "modify",
          "description": "Extend VideoPlayer with an optional Live TV schedule-seek capability (props such as an initial seek seconds and a seek token/version). When isLiveTV is enabled and a new seek token is received (e.g., on channel switch or program change), seek the underlying <video> to the provided offset after metadata is available, without reloading the source if unchanged. Ensure default/non-live usage remains unchanged (no seeking unless explicitly requested)."
        },
        {
          "path": "frontend/src/pages/LivePage.tsx",
          "operation": "modify",
          "description": "Compute the schedule-aligned playback offset for the currently airing scheduled item (using the looping schedule math), and pass it into VideoPlayer along with a token that changes only when the channel changes or the current scheduled content changes. Ensure rollover to the next program updates the videoUrl and seek offset appropriately."
        },
        {
          "path": "frontend/src/utils/epg.ts",
          "operation": "modify",
          "description": "Support schedule-aligned seeking by returning a precise offset (milliseconds/seconds) into the current scheduled program instance, suitable for clamping to the video duration on the player side."
        }
      ]
    }
  ]
}