{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add dual availability toggles and auto-generate clips from uploaded videos",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Update MoviesManagement to include dual availability toggles for eligibleForLive and availableAsVOD",
      "acceptanceCriteria": [
        "MoviesManagement upload form shows both checkboxes",
        "MoviesManagement edit dialog shows both checkboxes with current values",
        "Both toggles can be changed independently during edit",
        "Update mutation sends both flags to backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/MoviesManagement.tsx",
          "operation": "modify",
          "description": "Add two checkbox fields to the upload form and edit dialog: 'Eligible for Live TV scheduling' (maps to eligibleForLive) and 'Available as standalone VOD' (maps to availableAsVOD). Both should default to true for new uploads. Update the addVideo and updateVideo mutations to include both boolean flags. Ensure the edit dialog pre-populates both checkbox states from the selected video's current values."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Update PodcastsManagement to include dual availability toggles for eligibleForLive and availableAsVOD",
      "acceptanceCriteria": [
        "PodcastsManagement upload form shows both checkboxes",
        "PodcastsManagement edit dialog shows both checkboxes with current values",
        "Both toggles can be changed independently during edit",
        "Update mutation sends both flags to backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/PodcastsManagement.tsx",
          "operation": "modify",
          "description": "Add two checkbox fields to the upload form and edit dialog: 'Eligible for Live TV scheduling' (maps to eligibleForLive) and 'Available as standalone VOD' (maps to availableAsVOD). Both should default to true for new uploads. Update the addVideo and updateVideo mutations to include both boolean flags. Ensure the edit dialog pre-populates both checkbox states from the selected video's current values."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Update SeriesManagement episode forms to include dual availability toggles for eligibleForLive and availableAsVOD",
      "acceptanceCriteria": [
        "Episode creation form in SeriesManagement shows both checkboxes",
        "Episode edit dialog shows both checkboxes with current values",
        "Both toggles can be changed independently during edit",
        "Update mutation sends both flags to backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/SeriesManagement.tsx",
          "operation": "modify",
          "description": "Add two checkbox fields to the episode creation form and episode edit dialog: 'Eligible for Live TV scheduling' (maps to eligibleForLive) and 'Available as standalone VOD' (maps to availableAsVOD). Both should default to true for new episodes. Update the episode creation and update logic within addSeries and updateSeries mutations to include both boolean flags for each episode. Ensure the episode edit dialog pre-populates both checkbox states from the selected episode's current values."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Filter VOD pages to only display content where availableAsVOD is true",
      "acceptanceCriteria": [
        "MoviesPage only displays movies with availableAsVOD=true",
        "TVShowsPage only displays series with at least one episode where availableAsVOD=true",
        "SeriesDetailPage only shows episodes where availableAsVOD=true",
        "Live-only content (availableAsVOD=false) is hidden from these pages"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MoviesPage.tsx",
          "operation": "modify",
          "description": "Filter the movies array before rendering to only include videos where availableAsVOD is true. Update the filtering logic in the component to check video.availableAsVOD === true alongside the existing contentType filter."
        },
        {
          "path": "frontend/src/pages/TVShowsPage.tsx",
          "operation": "modify",
          "description": "Filter the series array to only include series that have at least one episode with availableAsVOD=true. Implement a filtering function that checks if series.seasons contains any season with episodes where availableAsVOD is true before displaying the series card."
        },
        {
          "path": "frontend/src/pages/SeriesDetailPage.tsx",
          "operation": "modify",
          "description": "Filter episodes within each season to only display episodes where availableAsVOD is true. Update the episode rendering logic to exclude episodes with availableAsVOD=false from the season's episode list. Maintain the season structure but hide unavailable episodes."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Enforce eligibleForLive filtering in LiveScheduleManagement to prevent VOD-only content from being scheduled",
      "acceptanceCriteria": [
        "LiveScheduleManagement filters available videos to only show eligibleForLive=true content",
        "Attempting to schedule a video with eligibleForLive=false is prevented or shows a validation error",
        "Existing scheduled programs continue to work"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/LiveScheduleManagement.tsx",
          "operation": "modify",
          "description": "Filter the available videos list in the scheduling UI to only show videos where eligibleForLive is true. Update the video selection dropdown or list to apply a filter checking video.eligibleForLive === true. Add validation logic that prevents adding programs to the schedule if eligibleForLive is false, displaying a user-friendly error message if attempted."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Update ClipsManagement to display auto-generated clips and allow caption editing",
      "acceptanceCriteria": [
        "ClipsManagement displays all clips including auto-generated ones",
        "Each clip row shows its title, caption, and source video title if available",
        "Admins can edit clip captions in the edit dialog",
        "Editing a clip does not remove its sourceVideoId link"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/ClipsManagement.tsx",
          "operation": "modify",
          "description": "Update the clips table/grid to display the clipCaption field if present, and show the source video title by looking up the sourceVideoId in the available videos list. Add a column or row section that displays 'Source: [video title]' when sourceVideoId is populated. Update the edit dialog to include a text input for clipCaption that allows admins to edit the caption. Ensure the update mutation preserves the sourceVideoId field when saving changes. Add visual distinction (e.g., badge or icon) to indicate auto-generated clips versus manually uploaded ones."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Ensure Podcasts section remains a separate tab in AdminPage with dedicated management interface",
      "acceptanceCriteria": [
        "AdminPage includes a 'Podcasts' tab separate from Movies and other sections",
        "Selecting the Podcasts tab renders PodcastsManagement component",
        "PodcastsManagement upload form defaults contentType to Podcast",
        "PodcastsManagement manage list only displays videos with contentType=Podcast"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Verify that the Podcasts tab exists as a separate tab in the admin interface. If not present, add a 'Podcasts' tab to the tab navigation that renders the PodcastsManagement component when selected. Ensure the tab order places Podcasts as a distinct section separate from Movies, Clips, Series, and other management sections."
        },
        {
          "path": "frontend/src/components/admin/PodcastsManagement.tsx",
          "operation": "modify",
          "description": "Verify that the upload form defaults contentType to 'podcast' and the manage list filters to only display videos where contentType equals 'podcast'. If these filters are not in place, update the getAllVideos query result to filter by contentType='podcast' before rendering the management table, and ensure new uploads set contentType to 'podcast' by default."
        }
      ]
    }
  ]
}